; ModuleID = 'srv6.c'
source_filename = "srv6.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.xdpcap_hook = type { [3 x i32]*, [4 x i32]*, [4 x i32]*, [5 x i32]* }
%struct.anon = type { [11 x i32]*, %struct.lpm_key_v4*, %struct.transit_behavior*, [256 x i32]*, [1 x i32]* }
%struct.lpm_key_v4 = type { i32, i32 }
%struct.transit_behavior = type { %struct.in6_addr, %struct.in6_addr, i32, i32, i32, i32, [5 x %struct.in6_addr] }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.anon.1 = type { [11 x i32]*, %struct.lpm_key_v6*, %struct.end_function*, [65536 x i32]*, [1 x i32]* }
%struct.lpm_key_v6 = type { i32, %struct.in6_addr }
%struct.end_function = type { [4 x i32], %union.anon.0, i32, i32, i32, i32 }
%union.anon.0 = type { [4 x i32] }
%struct.anon.2 = type { [11 x i32]*, %struct.lpm_key_v6*, %struct.transit_behavior*, [256 x i32]*, [1 x i32]* }
%struct.anon.3 = type { [14 x i32]*, [4 x i32]*, [4 x i32]*, [64 x i32]* }
%struct.anon.4 = type { [6 x i32]*, i32*, %struct.v6addr_heep*, [1 x i32]* }
%struct.v6addr_heep = type { %struct.in6_addr, %struct.in6_addr }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.args_mob_session = type <{ i8, %union.anon.8 }>
%union.anon.8 = type { i32 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdpcap_hook", scope: !2, file: !137, line: 62, type: !283, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Debian clang version 11.0.1-2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !130, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "srv6.c", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!4 = !{!5, !14, !44, !48}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 29782, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./../common/vmlinux.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 33712, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262, isUnsigned: true)
!43 = !DIEnumerator(name: "IPPROTO_MAX", value: 263, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 90510, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47}
!46 = !DIEnumerator(name: "BPF_FIB_LOOKUP_DIRECT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "BPF_FIB_LOOKUP_OUTPUT", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 36, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51}
!50 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!52 = !{!53, !54, !55, !57, !60, !71, !93, !65, !94, !95, !96, !97, !98, !109, !115}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 12, baseType: !56)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61, !53, !60}
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 32700, size: 192, elements: !63)
!63 = !{!64, !66, !67, !68, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !6, line: 32701, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 16, baseType: !7)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !62, file: !6, line: 32702, baseType: !65, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !62, file: !6, line: 32703, baseType: !65, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !62, file: !6, line: 32704, baseType: !65, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !62, file: !6, line: 32705, baseType: !65, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !62, file: !6, line: 32706, baseType: !65, size: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !6, line: 7911, size: 128, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !72, file: !6, line: 7916, baseType: !75, size: 128)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !72, file: !6, line: 7912, size: 128, elements: !76)
!76 = !{!77, !83, !88}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !75, file: !6, line: 7913, baseType: !78, size: 128)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !81)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 10, baseType: !80)
!80 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !{!82}
!82 = !DISubrange(count: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !75, file: !6, line: 7914, baseType: !84, size: 128)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 7670, baseType: !55)
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !75, file: !6, line: 7915, baseType: !89, size: 128)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !91)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !6, line: 7672, baseType: !65)
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !6, line: 43298, baseType: !55)
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !6, line: 90534, size: 32, elements: !126)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 90527, size: 512, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !114, !119, !120, !121, !125}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !99, file: !6, line: 90528, baseType: !79, size: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !99, file: !6, line: 90529, baseType: !79, size: 8, offset: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !99, file: !6, line: 90530, baseType: !85, size: 16, offset: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !99, file: !6, line: 90531, baseType: !85, size: 16, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !99, file: !6, line: 90532, baseType: !55, size: 16, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !99, file: !6, line: 90533, baseType: !65, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !6, line: 90534, baseType: !98, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !6, line: 90539, baseType: !109, size: 128, offset: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !6, line: 90539, size: 128, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !109, file: !6, line: 90540, baseType: !90, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !109, file: !6, line: 90541, baseType: !113, size: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !91)
!114 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !6, line: 90543, baseType: !115, size: 128, offset: 256)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !6, line: 90543, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !115, file: !6, line: 90544, baseType: !90, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !115, file: !6, line: 90545, baseType: !113, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !99, file: !6, line: 90547, baseType: !85, size: 16, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !99, file: !6, line: 90548, baseType: !85, size: 16, offset: 400)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !99, file: !6, line: 90549, baseType: !122, size: 48, offset: 416)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 6)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !99, file: !6, line: 90550, baseType: !122, size: 48, offset: 464)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !98, file: !6, line: 90535, baseType: !79, size: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !98, file: !6, line: 90536, baseType: !90, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !98, file: !6, line: 90537, baseType: !65, size: 32)
!130 = !{!131, !135, !154, !201, !232, !241, !0, !257, !265, !270, !276}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 485, type: !133, isLocal: false, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !91)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !137, line: 17, type: !138, isLocal: false, isDefinition: true)
!137 = !DIFile(filename: "./srv6_maps.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 11, size: 256, elements: !139)
!139 = !{!140, !145, !148, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !137, line: 13, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 448, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 14)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !138, file: !137, line: 14, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !91)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !138, file: !137, line: 15, baseType: !146, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !138, file: !137, line: 16, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 64)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "function_table", scope: !2, file: !137, line: 26, type: !156, isLocal: false, isDefinition: true)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 19, size: 320, elements: !157)
!157 = !{!158, !163, !170, !191, !196}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !137, line: 21, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 352, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 11)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !156, file: !137, line: 22, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpm_key_v6", file: !166, line: 33, size: 160, elements: !167)
!166 = !DIFile(filename: "./srv6_structs.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !165, file: !166, line: 35, baseType: !65, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !166, line: 36, baseType: !72, size: 128, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !156, file: !137, line: 23, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end_function", file: !166, line: 39, size: 384, elements: !173)
!173 = !{!174, !175, !187, !188, !189, !190}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !172, file: !166, line: 41, baseType: !113, size: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nexthop", scope: !172, file: !166, line: 50, baseType: !176, size: 128, offset: 128)
!176 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !172, file: !166, line: 42, size: 128, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v6addr", scope: !176, file: !166, line: 44, baseType: !113, size: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !176, file: !166, line: 49, baseType: !180, size: 128)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4", file: !166, line: 45, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !180, file: !166, line: 47, baseType: !65, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !180, file: !166, line: 48, baseType: !184, size: 96, offset: 32)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 3)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !172, file: !166, line: 53, baseType: !65, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flaver", scope: !172, file: !166, line: 54, baseType: !65, size: 32, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v4_addr_spos", scope: !172, file: !166, line: 55, baseType: !65, size: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v4_addr_dpos", scope: !172, file: !166, line: 56, baseType: !65, size: 32, offset: 352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !156, file: !137, line: 24, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2097152, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 65536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !156, file: !137, line: 25, baseType: !197, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 1)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "transit_table_v4", scope: !2, file: !137, line: 35, type: !203, isLocal: false, isDefinition: true)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 28, size: 320, elements: !204)
!204 = !{!205, !206, !212, !226, !231}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !137, line: 30, baseType: !159, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !203, file: !137, line: 31, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpm_key_v4", file: !166, line: 27, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !208, file: !166, line: 29, baseType: !65, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !208, file: !166, line: 30, baseType: !65, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !137, line: 32, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "transit_behavior", file: !166, line: 16, size: 1024, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !214, file: !166, line: 18, baseType: !72, size: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !214, file: !166, line: 19, baseType: !72, size: 128, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "s_prefixlen", scope: !214, file: !166, line: 20, baseType: !65, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "d_prefixlen", scope: !214, file: !166, line: 21, baseType: !65, size: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "segment_length", scope: !214, file: !166, line: 22, baseType: !65, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !214, file: !166, line: 23, baseType: !65, size: 32, offset: 352)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !214, file: !166, line: 24, baseType: !223, size: 640, offset: 384)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 640, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 5)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !203, file: !137, line: 33, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !203, file: !137, line: 34, baseType: !197, size: 64, offset: 256)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "transit_table_v6", scope: !2, file: !137, line: 44, type: !234, isLocal: false, isDefinition: true)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 37, size: 320, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !137, line: 39, baseType: !159, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !234, file: !137, line: 40, baseType: !164, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !137, line: 41, baseType: !213, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !234, file: !137, line: 42, baseType: !227, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !234, file: !137, line: 43, baseType: !197, size: 64, offset: 256)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "in_taple_v6_addr", scope: !2, file: !137, line: 52, type: !243, isLocal: false, isDefinition: true)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 46, size: 256, elements: !244)
!244 = !{!245, !248, !250, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !137, line: 48, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 192, elements: !123)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !243, file: !137, line: 49, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !243, file: !137, line: 50, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v6addr_heep", file: !166, line: 10, size: 256, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !252, file: !166, line: 12, baseType: !72, size: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !252, file: !166, line: 13, baseType: !72, size: 128, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !243, file: !137, line: 51, baseType: !197, size: 64, offset: 192)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !259, line: 52, type: !260, isLocal: true, isDefinition: true)
!259 = !DIFile(filename: "./../common/bpf_helper_defs.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!53, !53, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !259, line: 1121, type: !267, isLocal: true, isDefinition: true)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!54, !61, !60}
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !259, line: 1817, type: !272, isLocal: true, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!54, !53, !275, !60, !65}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !259, line: 1297, type: !278, isLocal: true, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!54, !53, !65, !281}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !6, line: 20, baseType: !282)
!282 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdpcap_hook", file: !137, line: 56, size: 256, elements: !284)
!284 = !{!285, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !137, line: 58, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 96, elements: !185)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !283, file: !137, line: 59, baseType: !146, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !283, file: !137, line: 60, baseType: !146, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !283, file: !137, line: 61, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !224)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{!"Debian clang version 11.0.1-2"}
!297 = distinct !DISubprogram(name: "srv6_handler", scope: !3, file: !3, line: 395, type: !298, scopeLine: 396, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!60, !61}
!300 = !{!301, !302, !303, !304, !312, !327, !340, !341, !342, !343, !344}
!301 = !DILocalVariable(name: "xdp", arg: 1, scope: !297, file: !3, line: 395, type: !61)
!302 = !DILocalVariable(name: "data", scope: !297, file: !3, line: 398, type: !53)
!303 = !DILocalVariable(name: "data_end", scope: !297, file: !3, line: 399, type: !53)
!304 = !DILocalVariable(name: "eth", scope: !297, file: !3, line: 400, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !6, line: 10332, size: 112, elements: !307)
!307 = !{!308, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !306, file: !6, line: 10333, baseType: !309, size: 48)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 48, elements: !123)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !306, file: !6, line: 10334, baseType: !309, size: 48, offset: 48)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !306, file: !6, line: 10335, baseType: !85, size: 16, offset: 96)
!312 = !DILocalVariable(name: "iph", scope: !297, file: !3, line: 401, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !6, line: 43652, size: 160, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !314, file: !6, line: 43653, baseType: !79, size: 4, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !314, file: !6, line: 43654, baseType: !79, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !314, file: !6, line: 43655, baseType: !79, size: 8, offset: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !314, file: !6, line: 43656, baseType: !85, size: 16, offset: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !314, file: !6, line: 43657, baseType: !85, size: 16, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !314, file: !6, line: 43658, baseType: !85, size: 16, offset: 48)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !314, file: !6, line: 43659, baseType: !79, size: 8, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !314, file: !6, line: 43660, baseType: !79, size: 8, offset: 72)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !314, file: !6, line: 43661, baseType: !94, size: 16, offset: 80)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !314, file: !6, line: 43662, baseType: !90, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !314, file: !6, line: 43663, baseType: !90, size: 32, offset: 128)
!327 = !DILocalVariable(name: "v6h", scope: !297, file: !3, line: 402, type: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !6, line: 43678, size: 320, elements: !330)
!330 = !{!331, !332, !333, !335, !336, !337, !338, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !329, file: !6, line: 43679, baseType: !79, size: 4, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !329, file: !6, line: 43680, baseType: !79, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !329, file: !6, line: 43681, baseType: !334, size: 24, offset: 8)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 24, elements: !185)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !329, file: !6, line: 43682, baseType: !85, size: 16, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !329, file: !6, line: 43683, baseType: !79, size: 8, offset: 48)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !329, file: !6, line: 43684, baseType: !79, size: 8, offset: 56)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !329, file: !6, line: 43685, baseType: !72, size: 128, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !329, file: !6, line: 43686, baseType: !72, size: 128, offset: 192)
!340 = !DILocalVariable(name: "ef_table", scope: !297, file: !3, line: 403, type: !171)
!341 = !DILocalVariable(name: "tb", scope: !297, file: !3, line: 404, type: !213)
!342 = !DILocalVariable(name: "v4key", scope: !297, file: !3, line: 405, type: !208)
!343 = !DILocalVariable(name: "v6key", scope: !297, file: !3, line: 406, type: !165)
!344 = !DILocalVariable(name: "h_proto", scope: !297, file: !3, line: 407, type: !55)
!345 = !DILocation(line: 0, scope: !297)
!346 = !DILocation(line: 398, column: 37, scope: !297)
!347 = !{!348, !349, i64 0}
!348 = !{!"xdp_md", !349, i64 0, !349, i64 4, !349, i64 8, !349, i64 12, !349, i64 16, !349, i64 20}
!349 = !{!"int", !350, i64 0}
!350 = !{!"omnipotent char", !351, i64 0}
!351 = !{!"Simple C/C++ TBAA"}
!352 = !DILocation(line: 398, column: 26, scope: !297)
!353 = !DILocation(line: 398, column: 18, scope: !297)
!354 = !DILocation(line: 399, column: 41, scope: !297)
!355 = !{!348, !349, i64 4}
!356 = !DILocation(line: 399, column: 30, scope: !297)
!357 = !DILocation(line: 399, column: 22, scope: !297)
!358 = !DILocalVariable(name: "xdp", arg: 1, scope: !359, file: !360, line: 241, type: !61)
!359 = distinct !DISubprogram(name: "get_ipv4", scope: !360, file: !360, line: 241, type: !361, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !363)
!360 = !DIFile(filename: "./srv6_helpers.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!361 = !DISubroutineType(types: !362)
!362 = !{!313, !61}
!363 = !{!358, !364, !365, !366}
!364 = !DILocalVariable(name: "data", scope: !359, file: !360, line: 243, type: !53)
!365 = !DILocalVariable(name: "data_end", scope: !359, file: !360, line: 244, type: !53)
!366 = !DILocalVariable(name: "iph", scope: !359, file: !360, line: 246, type: !313)
!367 = !DILocation(line: 0, scope: !359, inlinedAt: !368)
!368 = distinct !DILocation(line: 401, column: 25, scope: !297)
!369 = !DILocation(line: 247, column: 13, scope: !370, inlinedAt: !368)
!370 = distinct !DILexicalBlock(scope: !359, file: !360, line: 247, column: 9)
!371 = !DILocation(line: 247, column: 19, scope: !370, inlinedAt: !368)
!372 = !DILocation(line: 247, column: 17, scope: !370, inlinedAt: !368)
!373 = !DILocation(line: 247, column: 9, scope: !359, inlinedAt: !368)
!374 = !DILocalVariable(name: "xdp", arg: 1, scope: !375, file: !360, line: 228, type: !61)
!375 = distinct !DISubprogram(name: "get_ipv6", scope: !360, file: !360, line: 228, type: !376, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!328, !61}
!378 = !{!374, !379, !380, !381}
!379 = !DILocalVariable(name: "data", scope: !375, file: !360, line: 230, type: !53)
!380 = !DILocalVariable(name: "data_end", scope: !375, file: !360, line: 231, type: !53)
!381 = !DILocalVariable(name: "v6h", scope: !375, file: !360, line: 233, type: !328)
!382 = !DILocation(line: 0, scope: !375, inlinedAt: !383)
!383 = distinct !DILocation(line: 402, column: 27, scope: !297)
!384 = !DILocation(line: 235, column: 13, scope: !385, inlinedAt: !383)
!385 = distinct !DILexicalBlock(scope: !375, file: !360, line: 235, column: 9)
!386 = !DILocation(line: 235, column: 19, scope: !385, inlinedAt: !383)
!387 = !DILocation(line: 235, column: 17, scope: !385, inlinedAt: !383)
!388 = !DILocation(line: 235, column: 9, scope: !375, inlinedAt: !383)
!389 = !DILocation(line: 405, column: 5, scope: !297)
!390 = !DILocation(line: 405, column: 23, scope: !297)
!391 = !DILocation(line: 406, column: 5, scope: !297)
!392 = !DILocation(line: 406, column: 23, scope: !297)
!393 = !DILocation(line: 409, column: 29, scope: !394)
!394 = distinct !DILexicalBlock(scope: !297, file: !3, line: 409, column: 9)
!395 = !DILocation(line: 409, column: 9, scope: !297)
!396 = !DILocalVariable(name: "ctx", arg: 1, scope: !397, file: !398, line: 29, type: !61)
!397 = distinct !DISubprogram(name: "xdpcap_exit", scope: !398, file: !398, line: 29, type: !399, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !401)
!398 = !DIFile(filename: "./hook.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!399 = !DISubroutineType(types: !400)
!400 = !{!5, !61, !53, !5}
!401 = !{!396, !402, !403}
!402 = !DILocalVariable(name: "hook_map", arg: 2, scope: !397, file: !398, line: 29, type: !53)
!403 = !DILocalVariable(name: "action", arg: 3, scope: !397, file: !398, line: 29, type: !5)
!404 = !DILocation(line: 0, scope: !397, inlinedAt: !405)
!405 = distinct !DILocation(line: 410, column: 16, scope: !394)
!406 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !405)
!407 = !DILocation(line: 410, column: 9, scope: !394)
!408 = !DILocation(line: 400, column: 26, scope: !297)
!409 = !DILocation(line: 412, column: 20, scope: !297)
!410 = !{!411, !412, i64 12}
!411 = !{!"ethhdr", !350, i64 0, !350, i64 6, !412, i64 12}
!412 = !{!"short", !350, i64 0}
!413 = !DILocation(line: 413, column: 9, scope: !297)
!414 = !DILocation(line: 415, column: 14, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !3, line: 415, column: 13)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 414, column: 5)
!417 = distinct !DILexicalBlock(scope: !297, file: !3, line: 413, column: 9)
!418 = !DILocation(line: 415, column: 13, scope: !416)
!419 = !DILocation(line: 0, scope: !397, inlinedAt: !420)
!420 = distinct !DILocation(line: 416, column: 20, scope: !415)
!421 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !420)
!422 = !DILocation(line: 416, column: 13, scope: !415)
!423 = !DILocation(line: 418, column: 15, scope: !416)
!424 = !DILocation(line: 418, column: 25, scope: !416)
!425 = !{!426, !349, i64 0}
!426 = !{!"lpm_key_v4", !349, i64 0, !349, i64 4}
!427 = !DILocation(line: 419, column: 27, scope: !416)
!428 = !{!429, !349, i64 16}
!429 = !{!"iphdr", !350, i64 0, !350, i64 0, !350, i64 1, !412, i64 2, !412, i64 4, !412, i64 6, !350, i64 8, !350, i64 9, !412, i64 10, !349, i64 12, !349, i64 16}
!430 = !DILocation(line: 419, column: 15, scope: !416)
!431 = !DILocation(line: 419, column: 20, scope: !416)
!432 = !{!426, !349, i64 4}
!433 = !DILocation(line: 421, column: 14, scope: !416)
!434 = !DILocation(line: 422, column: 13, scope: !435)
!435 = distinct !DILexicalBlock(scope: !416, file: !3, line: 422, column: 13)
!436 = !DILocation(line: 422, column: 13, scope: !416)
!437 = !DILocation(line: 425, column: 25, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 423, column: 9)
!439 = !{!440, !349, i64 44}
!440 = !{!"transit_behavior", !441, i64 0, !441, i64 16, !349, i64 32, !349, i64 36, !349, i64 40, !349, i64 44, !350, i64 48}
!441 = !{!"in6_addr", !350, i64 0}
!442 = !DILocation(line: 425, column: 13, scope: !438)
!443 = !DILocation(line: 428, column: 92, scope: !444)
!444 = distinct !DILexicalBlock(scope: !438, file: !3, line: 426, column: 13)
!445 = !{!429, !412, i64 2}
!446 = !DILocation(line: 428, column: 55, scope: !444)
!447 = !DILocation(line: 0, scope: !397, inlinedAt: !448)
!448 = distinct !DILocation(line: 428, column: 24, scope: !444)
!449 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !448)
!450 = !DILocation(line: 428, column: 17, scope: !444)
!451 = !DILocalVariable(name: "xdp", arg: 1, scope: !452, file: !3, line: 156, type: !61)
!452 = distinct !DISubprogram(name: "transit_gtp4_encap", scope: !3, file: !3, line: 156, type: !453, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{!60, !61, !213}
!455 = !{!451, !456, !457, !458, !459, !460, !461, !462, !463, !478, !479, !480, !481, !482, !483, !484, !492, !493, !494, !509, !510, !511, !512, !513, !514, !515, !516}
!456 = !DILocalVariable(name: "tb", arg: 2, scope: !452, file: !3, line: 156, type: !213)
!457 = !DILocalVariable(name: "data", scope: !452, file: !3, line: 159, type: !53)
!458 = !DILocalVariable(name: "data_end", scope: !452, file: !3, line: 160, type: !53)
!459 = !DILocalVariable(name: "iph", scope: !452, file: !3, line: 161, type: !313)
!460 = !DILocalVariable(name: "type", scope: !452, file: !3, line: 162, type: !79)
!461 = !DILocalVariable(name: "tid", scope: !452, file: !3, line: 163, type: !65)
!462 = !DILocalVariable(name: "v6h", scope: !452, file: !3, line: 165, type: !328)
!463 = !DILocalVariable(name: "srh", scope: !452, file: !3, line: 166, type: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "srhhdr", file: !166, line: 61, size: 64, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nextHdr", scope: !465, file: !166, line: 63, baseType: !79, size: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "hdrExtLen", scope: !465, file: !166, line: 64, baseType: !79, size: 8, offset: 8)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "routingType", scope: !465, file: !166, line: 65, baseType: !79, size: 8, offset: 16)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "segmentsLeft", scope: !465, file: !166, line: 66, baseType: !79, size: 8, offset: 24)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lastEntry", scope: !465, file: !166, line: 67, baseType: !79, size: 8, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !166, line: 68, baseType: !79, size: 8, offset: 40)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !465, file: !166, line: 69, baseType: !55, size: 16, offset: 48)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !465, file: !166, line: 72, baseType: !475, offset: 64)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 0)
!478 = !DILocalVariable(name: "srh_len", scope: !452, file: !3, line: 167, type: !79)
!479 = !DILocalVariable(name: "decap_len", scope: !452, file: !3, line: 168, type: !55)
!480 = !DILocalVariable(name: "encap_len", scope: !452, file: !3, line: 168, type: !55)
!481 = !DILocalVariable(name: "innerlen", scope: !452, file: !3, line: 169, type: !55)
!482 = !DILocalVariable(name: "outer_saddr", scope: !452, file: !3, line: 170, type: !65)
!483 = !DILocalVariable(name: "outer_daddr", scope: !452, file: !3, line: 170, type: !65)
!484 = !DILocalVariable(name: "gtp1h", scope: !452, file: !3, line: 178, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gtp1hdr", file: !166, line: 76, size: 64, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !486, file: !166, line: 84, baseType: !79, size: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !166, line: 85, baseType: !79, size: 8, offset: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !486, file: !166, line: 86, baseType: !55, size: 16, offset: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !486, file: !166, line: 87, baseType: !65, size: 32, offset: 32)
!492 = !DILocalVariable(name: "seg_len", scope: !452, file: !3, line: 207, type: !65)
!493 = !DILocalVariable(name: "new_eth", scope: !452, file: !3, line: 222, type: !305)
!494 = !DILocalVariable(name: "args", scope: !452, file: !3, line: 243, type: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "args_mob_session", file: !166, line: 97, size: 40, elements: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "qfi", scope: !495, file: !166, line: 99, baseType: !79, size: 6, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !495, file: !166, line: 100, baseType: !79, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !495, file: !166, line: 101, baseType: !79, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !495, file: !166, line: 111, baseType: !501, size: 32, offset: 8)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !495, file: !166, line: 103, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_session_id", scope: !501, file: !166, line: 105, baseType: !65, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !501, file: !166, line: 110, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq", file: !166, line: 106, size: 32, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !505, file: !166, line: 108, baseType: !55, size: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !505, file: !166, line: 109, baseType: !55, size: 16, offset: 16)
!509 = !DILocalVariable(name: "s_offset", scope: !452, file: !3, line: 244, type: !55)
!510 = !DILocalVariable(name: "s_shift", scope: !452, file: !3, line: 244, type: !55)
!511 = !DILocalVariable(name: "d_offset", scope: !452, file: !3, line: 244, type: !55)
!512 = !DILocalVariable(name: "d_shift", scope: !452, file: !3, line: 244, type: !55)
!513 = !DILocalVariable(name: "src_p", scope: !452, file: !3, line: 258, type: !96)
!514 = !DILocalVariable(name: "dst_p", scope: !452, file: !3, line: 258, type: !96)
!515 = !DILocalVariable(name: "args_p", scope: !452, file: !3, line: 258, type: !96)
!516 = !DILocalVariable(name: "i", scope: !517, file: !3, line: 286, type: !55)
!517 = distinct !DILexicalBlock(scope: !452, file: !3, line: 286, column: 5)
!518 = !DILocation(line: 0, scope: !452, inlinedAt: !519)
!519 = distinct !DILocation(line: 431, column: 55, scope: !444)
!520 = !DILocation(line: 159, column: 46, scope: !452, inlinedAt: !519)
!521 = !DILocation(line: 159, column: 26, scope: !452, inlinedAt: !519)
!522 = !DILocation(line: 159, column: 18, scope: !452, inlinedAt: !519)
!523 = !DILocation(line: 160, column: 50, scope: !452, inlinedAt: !519)
!524 = !DILocation(line: 0, scope: !359, inlinedAt: !525)
!525 = distinct !DILocation(line: 161, column: 25, scope: !452, inlinedAt: !519)
!526 = !DILocation(line: 244, column: 30, scope: !359, inlinedAt: !525)
!527 = !DILocation(line: 247, column: 13, scope: !370, inlinedAt: !525)
!528 = !DILocation(line: 247, column: 19, scope: !370, inlinedAt: !525)
!529 = !DILocation(line: 247, column: 17, scope: !370, inlinedAt: !525)
!530 = !DILocation(line: 247, column: 9, scope: !359, inlinedAt: !525)
!531 = !DILocation(line: 170, column: 5, scope: !452, inlinedAt: !519)
!532 = !DILocation(line: 171, column: 10, scope: !533, inlinedAt: !519)
!533 = distinct !DILexicalBlock(scope: !452, file: !3, line: 171, column: 9)
!534 = !DILocation(line: 171, column: 9, scope: !452, inlinedAt: !519)
!535 = !DILocation(line: 160, column: 22, scope: !452, inlinedAt: !519)
!536 = !DILocation(line: 175, column: 14, scope: !537, inlinedAt: !519)
!537 = distinct !DILexicalBlock(scope: !452, file: !3, line: 175, column: 9)
!538 = !{!429, !350, i64 9}
!539 = !DILocation(line: 175, column: 23, scope: !537, inlinedAt: !519)
!540 = !DILocation(line: 175, column: 9, scope: !452, inlinedAt: !519)
!541 = !DILocation(line: 182, column: 43, scope: !452, inlinedAt: !519)
!542 = !DILocation(line: 182, column: 5, scope: !452, inlinedAt: !519)
!543 = !DILocation(line: 183, column: 43, scope: !452, inlinedAt: !519)
!544 = !DILocation(line: 183, column: 5, scope: !452, inlinedAt: !519)
!545 = !DILocation(line: 188, column: 18, scope: !452, inlinedAt: !519)
!546 = !{!547, !349, i64 4}
!547 = !{!"gtp1hdr", !350, i64 0, !350, i64 1, !412, i64 2, !349, i64 4}
!548 = !DILocation(line: 189, column: 19, scope: !452, inlinedAt: !519)
!549 = !{!547, !350, i64 1}
!550 = !DILocation(line: 190, column: 16, scope: !452, inlinedAt: !519)
!551 = !{!547, !412, i64 2}
!552 = !DILocation(line: 192, column: 14, scope: !553, inlinedAt: !519)
!553 = distinct !DILexicalBlock(scope: !452, file: !3, line: 192, column: 9)
!554 = !DILocation(line: 192, column: 9, scope: !452, inlinedAt: !519)
!555 = !DILocation(line: 195, column: 13, scope: !556, inlinedAt: !519)
!556 = distinct !DILexicalBlock(scope: !452, file: !3, line: 195, column: 9)
!557 = !{!440, !349, i64 32}
!558 = !DILocation(line: 195, column: 25, scope: !556, inlinedAt: !519)
!559 = !DILocation(line: 195, column: 30, scope: !556, inlinedAt: !519)
!560 = !DILocation(line: 195, column: 37, scope: !556, inlinedAt: !519)
!561 = !{!440, !349, i64 36}
!562 = !DILocation(line: 195, column: 54, scope: !556, inlinedAt: !519)
!563 = !DILocation(line: 207, column: 25, scope: !452, inlinedAt: !519)
!564 = !{!440, !349, i64 40}
!565 = !DILocation(line: 207, column: 40, scope: !452, inlinedAt: !519)
!566 = !DILocation(line: 208, column: 66, scope: !452, inlinedAt: !519)
!567 = !DILocation(line: 208, column: 64, scope: !452, inlinedAt: !519)
!568 = !DILocation(line: 208, column: 37, scope: !452, inlinedAt: !519)
!569 = !DILocation(line: 211, column: 23, scope: !452, inlinedAt: !519)
!570 = !DILocation(line: 213, column: 9, scope: !571, inlinedAt: !519)
!571 = distinct !DILexicalBlock(scope: !452, file: !3, line: 213, column: 9)
!572 = !DILocation(line: 213, column: 9, scope: !452, inlinedAt: !519)
!573 = !DILocation(line: 210, column: 42, scope: !452, inlinedAt: !519)
!574 = !DILocation(line: 210, column: 40, scope: !452, inlinedAt: !519)
!575 = !DILocation(line: 216, column: 36, scope: !576, inlinedAt: !519)
!576 = distinct !DILexicalBlock(scope: !452, file: !3, line: 216, column: 9)
!577 = !DILocation(line: 216, column: 9, scope: !576, inlinedAt: !519)
!578 = !DILocation(line: 216, column: 9, scope: !452, inlinedAt: !519)
!579 = !DILocation(line: 219, column: 31, scope: !452, inlinedAt: !519)
!580 = !DILocation(line: 219, column: 20, scope: !452, inlinedAt: !519)
!581 = !DILocation(line: 220, column: 35, scope: !452, inlinedAt: !519)
!582 = !DILocation(line: 220, column: 24, scope: !452, inlinedAt: !519)
!583 = !DILocation(line: 220, column: 16, scope: !452, inlinedAt: !519)
!584 = !DILocation(line: 223, column: 32, scope: !585, inlinedAt: !519)
!585 = distinct !DILexicalBlock(scope: !452, file: !3, line: 223, column: 9)
!586 = !DILocation(line: 223, column: 9, scope: !585, inlinedAt: !519)
!587 = !DILocation(line: 223, column: 57, scope: !585, inlinedAt: !519)
!588 = !DILocation(line: 223, column: 9, scope: !452, inlinedAt: !519)
!589 = !DILocation(line: 222, column: 30, scope: !452, inlinedAt: !519)
!590 = !DILocation(line: 219, column: 12, scope: !452, inlinedAt: !519)
!591 = !DILocation(line: 226, column: 14, scope: !452, inlinedAt: !519)
!592 = !DILocation(line: 226, column: 22, scope: !452, inlinedAt: !519)
!593 = !DILocation(line: 228, column: 24, scope: !452, inlinedAt: !519)
!594 = !DILocation(line: 228, column: 11, scope: !452, inlinedAt: !519)
!595 = !DILocation(line: 229, column: 47, scope: !596, inlinedAt: !519)
!596 = distinct !DILexicalBlock(scope: !452, file: !3, line: 229, column: 9)
!597 = !DILocation(line: 229, column: 73, scope: !596, inlinedAt: !519)
!598 = !DILocation(line: 229, column: 9, scope: !452, inlinedAt: !519)
!599 = !DILocation(line: 232, column: 10, scope: !452, inlinedAt: !519)
!600 = !DILocation(line: 232, column: 18, scope: !452, inlinedAt: !519)
!601 = !DILocation(line: 233, column: 10, scope: !452, inlinedAt: !519)
!602 = !DILocation(line: 233, column: 19, scope: !452, inlinedAt: !519)
!603 = !DILocation(line: 234, column: 10, scope: !452, inlinedAt: !519)
!604 = !DILocation(line: 234, column: 18, scope: !452, inlinedAt: !519)
!605 = !{!606, !350, i64 6}
!606 = !{!"ipv6hdr", !350, i64 0, !350, i64 0, !350, i64 1, !412, i64 4, !350, i64 6, !350, i64 7, !441, i64 8, !441, i64 24}
!607 = !DILocation(line: 235, column: 10, scope: !452, inlinedAt: !519)
!608 = !DILocation(line: 235, column: 20, scope: !452, inlinedAt: !519)
!609 = !{!606, !350, i64 7}
!610 = !DILocation(line: 236, column: 10, scope: !452, inlinedAt: !519)
!611 = !DILocation(line: 236, column: 22, scope: !452, inlinedAt: !519)
!612 = !{!606, !412, i64 4}
!613 = !DILocation(line: 237, column: 28, scope: !452, inlinedAt: !519)
!614 = !DILocation(line: 237, column: 5, scope: !452, inlinedAt: !519)
!615 = !DILocation(line: 238, column: 21, scope: !616, inlinedAt: !519)
!616 = distinct !DILexicalBlock(scope: !452, file: !3, line: 238, column: 9)
!617 = !DILocation(line: 241, column: 28, scope: !452, inlinedAt: !519)
!618 = !DILocation(line: 241, column: 5, scope: !452, inlinedAt: !519)
!619 = !DILocation(line: 241, column: 40, scope: !452, inlinedAt: !519)
!620 = !DILocation(line: 241, column: 36, scope: !452, inlinedAt: !519)
!621 = !DILocation(line: 243, column: 5, scope: !452, inlinedAt: !519)
!622 = !DILocation(line: 243, column: 29, scope: !452, inlinedAt: !519)
!623 = !DILocation(line: 246, column: 20, scope: !452, inlinedAt: !519)
!624 = !DILocation(line: 246, column: 32, scope: !452, inlinedAt: !519)
!625 = !DILocation(line: 246, column: 16, scope: !452, inlinedAt: !519)
!626 = !DILocation(line: 247, column: 15, scope: !452, inlinedAt: !519)
!627 = !DILocation(line: 248, column: 20, scope: !452, inlinedAt: !519)
!628 = !DILocation(line: 248, column: 32, scope: !452, inlinedAt: !519)
!629 = !DILocation(line: 248, column: 16, scope: !452, inlinedAt: !519)
!630 = !DILocation(line: 249, column: 15, scope: !452, inlinedAt: !519)
!631 = !DILocation(line: 253, column: 12, scope: !452, inlinedAt: !519)
!632 = !DILocation(line: 255, column: 18, scope: !452, inlinedAt: !519)
!633 = !DILocation(line: 255, column: 33, scope: !452, inlinedAt: !519)
!634 = !{!350, !350, i64 0}
!635 = !DILocalVariable(name: "v6addr", arg: 1, scope: !636, file: !360, line: 104, type: !71)
!636 = distinct !DISubprogram(name: "write_v6addr_in_pyload", scope: !360, file: !360, line: 103, type: !637, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !641)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !71, !96, !55, !55, !55, !639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!641 = !{!635, !642, !643, !644, !645, !646, !647, !651, !654}
!642 = !DILocalVariable(name: "payload", arg: 2, scope: !636, file: !360, line: 104, type: !96)
!643 = !DILocalVariable(name: "payload_size", arg: 3, scope: !636, file: !360, line: 104, type: !55)
!644 = !DILocalVariable(name: "offset", arg: 4, scope: !636, file: !360, line: 104, type: !55)
!645 = !DILocalVariable(name: "shift", arg: 5, scope: !636, file: !360, line: 104, type: !55)
!646 = !DILocalVariable(name: "data_end", arg: 6, scope: !636, file: !360, line: 104, type: !639)
!647 = !DILocalVariable(name: "index", scope: !648, file: !360, line: 123, type: !55)
!648 = distinct !DILexicalBlock(scope: !649, file: !360, line: 123, column: 9)
!649 = distinct !DILexicalBlock(scope: !650, file: !360, line: 121, column: 5)
!650 = distinct !DILexicalBlock(scope: !636, file: !360, line: 113, column: 9)
!651 = !DILocalVariable(name: "v6val1", scope: !652, file: !360, line: 130, type: !96)
!652 = distinct !DILexicalBlock(scope: !653, file: !360, line: 124, column: 9)
!653 = distinct !DILexicalBlock(scope: !648, file: !360, line: 123, column: 9)
!654 = !DILocalVariable(name: "v6val2", scope: !652, file: !360, line: 131, type: !96)
!655 = !DILocation(line: 0, scope: !636, inlinedAt: !656)
!656 = distinct !DILocation(line: 263, column: 5, scope: !452, inlinedAt: !519)
!657 = !DILocation(line: 106, column: 21, scope: !636, inlinedAt: !656)
!658 = !DILocation(line: 108, column: 36, scope: !659, inlinedAt: !656)
!659 = distinct !DILexicalBlock(scope: !636, file: !360, line: 108, column: 9)
!660 = !DILocation(line: 108, column: 43, scope: !659, inlinedAt: !656)
!661 = !DILocation(line: 113, column: 9, scope: !650, inlinedAt: !656)
!662 = !DILocation(line: 113, column: 15, scope: !650, inlinedAt: !656)
!663 = !DILocation(line: 0, scope: !650, inlinedAt: !656)
!664 = !DILocation(line: 113, column: 9, scope: !636, inlinedAt: !656)
!665 = !DILocation(line: 0, scope: !648, inlinedAt: !656)
!666 = !DILocation(line: 0, scope: !667, inlinedAt: !656)
!667 = distinct !DILexicalBlock(scope: !668, file: !360, line: 133, column: 13)
!668 = distinct !DILexicalBlock(scope: !652, file: !360, line: 132, column: 17)
!669 = !DILocation(line: 123, column: 9, scope: !648, inlinedAt: !656)
!670 = !DILocation(line: 115, column: 37, scope: !671, inlinedAt: !656)
!671 = distinct !DILexicalBlock(scope: !672, file: !360, line: 115, column: 13)
!672 = distinct !DILexicalBlock(scope: !650, file: !360, line: 114, column: 5)
!673 = !DILocation(line: 115, column: 52, scope: !671, inlinedAt: !656)
!674 = !DILocation(line: 115, column: 13, scope: !672, inlinedAt: !656)
!675 = !DILocation(line: 118, column: 35, scope: !672, inlinedAt: !656)
!676 = !DILocation(line: 118, column: 41, scope: !672, inlinedAt: !656)
!677 = !DILocation(line: 118, column: 27, scope: !672, inlinedAt: !656)
!678 = !DILocation(line: 118, column: 9, scope: !672, inlinedAt: !656)
!679 = !DILocation(line: 119, column: 5, scope: !672, inlinedAt: !656)
!680 = !DILocation(line: 130, column: 60, scope: !652, inlinedAt: !656)
!681 = !DILocation(line: 0, scope: !652, inlinedAt: !656)
!682 = !DILocation(line: 131, column: 68, scope: !652, inlinedAt: !656)
!683 = !DILocation(line: 132, column: 28, scope: !668, inlinedAt: !656)
!684 = !DILocation(line: 132, column: 40, scope: !668, inlinedAt: !656)
!685 = !DILocation(line: 134, column: 28, scope: !667, inlinedAt: !656)
!686 = !DILocation(line: 134, column: 43, scope: !667, inlinedAt: !656)
!687 = !DILocation(line: 134, column: 25, scope: !667, inlinedAt: !656)
!688 = !DILocation(line: 135, column: 43, scope: !667, inlinedAt: !656)
!689 = !DILocation(line: 135, column: 25, scope: !667, inlinedAt: !656)
!690 = !DILocation(line: 123, column: 69, scope: !653, inlinedAt: !656)
!691 = distinct !{!691, !669, !692, !693}
!692 = !DILocation(line: 139, column: 9, scope: !648, inlinedAt: !656)
!693 = !{!"llvm.loop.unroll.disable"}
!694 = !DILocation(line: 266, column: 72, scope: !695, inlinedAt: !519)
!695 = distinct !DILexicalBlock(scope: !452, file: !3, line: 266, column: 9)
!696 = !DILocation(line: 266, column: 97, scope: !695, inlinedAt: !519)
!697 = !DILocation(line: 266, column: 9, scope: !452, inlinedAt: !519)
!698 = !DILocation(line: 269, column: 18, scope: !452, inlinedAt: !519)
!699 = !{!700, !350, i64 0}
!700 = !{!"srhhdr", !350, i64 0, !350, i64 1, !350, i64 2, !350, i64 3, !350, i64 4, !350, i64 5, !412, i64 6, !350, i64 8}
!701 = !DILocation(line: 270, column: 32, scope: !452, inlinedAt: !519)
!702 = !DILocation(line: 270, column: 37, scope: !452, inlinedAt: !519)
!703 = !DILocation(line: 270, column: 10, scope: !452, inlinedAt: !519)
!704 = !DILocation(line: 270, column: 20, scope: !452, inlinedAt: !519)
!705 = !{!700, !350, i64 1}
!706 = !DILocation(line: 271, column: 10, scope: !452, inlinedAt: !519)
!707 = !DILocation(line: 271, column: 22, scope: !452, inlinedAt: !519)
!708 = !{!700, !350, i64 2}
!709 = !DILocation(line: 272, column: 25, scope: !452, inlinedAt: !519)
!710 = !DILocation(line: 272, column: 10, scope: !452, inlinedAt: !519)
!711 = !DILocation(line: 272, column: 23, scope: !452, inlinedAt: !519)
!712 = !{!700, !350, i64 3}
!713 = !DILocation(line: 273, column: 10, scope: !452, inlinedAt: !519)
!714 = !DILocation(line: 273, column: 20, scope: !452, inlinedAt: !519)
!715 = !{!700, !350, i64 4}
!716 = !DILocation(line: 274, column: 10, scope: !452, inlinedAt: !519)
!717 = !DILocation(line: 274, column: 16, scope: !452, inlinedAt: !519)
!718 = !{!700, !350, i64 5}
!719 = !DILocation(line: 275, column: 10, scope: !452, inlinedAt: !519)
!720 = !DILocation(line: 275, column: 14, scope: !452, inlinedAt: !519)
!721 = !{!700, !412, i64 6}
!722 = !DILocation(line: 276, column: 122, scope: !723, inlinedAt: !519)
!723 = distinct !DILexicalBlock(scope: !452, file: !3, line: 276, column: 9)
!724 = !DILocation(line: 276, column: 127, scope: !723, inlinedAt: !519)
!725 = !DILocation(line: 276, column: 9, scope: !452, inlinedAt: !519)
!726 = !DILocation(line: 279, column: 5, scope: !452, inlinedAt: !519)
!727 = !DILocation(line: 280, column: 28, scope: !452, inlinedAt: !519)
!728 = !DILocation(line: 280, column: 23, scope: !452, inlinedAt: !519)
!729 = !DILocation(line: 280, column: 46, scope: !452, inlinedAt: !519)
!730 = !DILocation(line: 280, column: 5, scope: !452, inlinedAt: !519)
!731 = !DILocation(line: 0, scope: !636, inlinedAt: !732)
!732 = distinct !DILocation(line: 281, column: 5, scope: !452, inlinedAt: !519)
!733 = !DILocation(line: 106, column: 21, scope: !636, inlinedAt: !732)
!734 = !DILocation(line: 108, column: 36, scope: !659, inlinedAt: !732)
!735 = !DILocation(line: 108, column: 43, scope: !659, inlinedAt: !732)
!736 = !DILocation(line: 113, column: 15, scope: !650, inlinedAt: !732)
!737 = !DILocation(line: 0, scope: !650, inlinedAt: !732)
!738 = !DILocation(line: 113, column: 9, scope: !636, inlinedAt: !732)
!739 = !DILocation(line: 0, scope: !648, inlinedAt: !732)
!740 = !DILocation(line: 0, scope: !667, inlinedAt: !732)
!741 = !DILocation(line: 123, column: 9, scope: !648, inlinedAt: !732)
!742 = !DILocation(line: 115, column: 37, scope: !671, inlinedAt: !732)
!743 = !DILocation(line: 115, column: 52, scope: !671, inlinedAt: !732)
!744 = !DILocation(line: 115, column: 13, scope: !672, inlinedAt: !732)
!745 = !DILocation(line: 118, column: 35, scope: !672, inlinedAt: !732)
!746 = !DILocation(line: 118, column: 41, scope: !672, inlinedAt: !732)
!747 = !DILocation(line: 118, column: 27, scope: !672, inlinedAt: !732)
!748 = !DILocation(line: 118, column: 9, scope: !672, inlinedAt: !732)
!749 = !DILocation(line: 119, column: 5, scope: !672, inlinedAt: !732)
!750 = !DILocation(line: 130, column: 60, scope: !652, inlinedAt: !732)
!751 = !DILocation(line: 0, scope: !652, inlinedAt: !732)
!752 = !DILocation(line: 131, column: 68, scope: !652, inlinedAt: !732)
!753 = !DILocation(line: 132, column: 28, scope: !668, inlinedAt: !732)
!754 = !DILocation(line: 132, column: 40, scope: !668, inlinedAt: !732)
!755 = !DILocation(line: 134, column: 28, scope: !667, inlinedAt: !732)
!756 = !DILocation(line: 134, column: 43, scope: !667, inlinedAt: !732)
!757 = !DILocation(line: 134, column: 25, scope: !667, inlinedAt: !732)
!758 = !DILocation(line: 135, column: 28, scope: !667, inlinedAt: !732)
!759 = !DILocation(line: 135, column: 43, scope: !667, inlinedAt: !732)
!760 = !DILocation(line: 135, column: 25, scope: !667, inlinedAt: !732)
!761 = !DILocation(line: 123, column: 69, scope: !653, inlinedAt: !732)
!762 = distinct !{!762, !741, !763, !693}
!763 = !DILocation(line: 139, column: 9, scope: !648, inlinedAt: !732)
!764 = !DILocation(line: 282, column: 14, scope: !452, inlinedAt: !519)
!765 = !DILocation(line: 0, scope: !636, inlinedAt: !766)
!766 = distinct !DILocation(line: 283, column: 5, scope: !452, inlinedAt: !519)
!767 = !DILocation(line: 106, column: 21, scope: !636, inlinedAt: !766)
!768 = !DILocation(line: 108, column: 36, scope: !659, inlinedAt: !766)
!769 = !DILocation(line: 108, column: 43, scope: !659, inlinedAt: !766)
!770 = !DILocation(line: 113, column: 15, scope: !650, inlinedAt: !766)
!771 = !DILocation(line: 0, scope: !650, inlinedAt: !766)
!772 = !DILocation(line: 113, column: 9, scope: !636, inlinedAt: !766)
!773 = !DILocation(line: 0, scope: !648, inlinedAt: !766)
!774 = !DILocation(line: 0, scope: !667, inlinedAt: !766)
!775 = !DILocation(line: 123, column: 9, scope: !648, inlinedAt: !766)
!776 = !DILocation(line: 115, column: 37, scope: !671, inlinedAt: !766)
!777 = !DILocation(line: 115, column: 52, scope: !671, inlinedAt: !766)
!778 = !DILocation(line: 115, column: 13, scope: !672, inlinedAt: !766)
!779 = !DILocation(line: 118, column: 35, scope: !672, inlinedAt: !766)
!780 = !DILocation(line: 118, column: 41, scope: !672, inlinedAt: !766)
!781 = !DILocation(line: 118, column: 27, scope: !672, inlinedAt: !766)
!782 = !DILocation(line: 118, column: 9, scope: !672, inlinedAt: !766)
!783 = !DILocation(line: 119, column: 5, scope: !672, inlinedAt: !766)
!784 = !DILocation(line: 130, column: 60, scope: !652, inlinedAt: !766)
!785 = !DILocation(line: 0, scope: !652, inlinedAt: !766)
!786 = !DILocation(line: 131, column: 68, scope: !652, inlinedAt: !766)
!787 = !DILocation(line: 132, column: 28, scope: !668, inlinedAt: !766)
!788 = !DILocation(line: 132, column: 40, scope: !668, inlinedAt: !766)
!789 = !DILocation(line: 134, column: 28, scope: !667, inlinedAt: !766)
!790 = !DILocation(line: 134, column: 43, scope: !667, inlinedAt: !766)
!791 = !DILocation(line: 134, column: 25, scope: !667, inlinedAt: !766)
!792 = !DILocation(line: 135, column: 28, scope: !667, inlinedAt: !766)
!793 = !DILocation(line: 135, column: 43, scope: !667, inlinedAt: !766)
!794 = !DILocation(line: 135, column: 25, scope: !667, inlinedAt: !766)
!795 = !DILocation(line: 123, column: 69, scope: !653, inlinedAt: !766)
!796 = distinct !{!796, !775, !797, !693}
!797 = !DILocation(line: 139, column: 9, scope: !648, inlinedAt: !766)
!798 = !DILocation(line: 0, scope: !517, inlinedAt: !519)
!799 = !DILocation(line: 286, column: 5, scope: !517, inlinedAt: !519)
!800 = !DILocation(line: 0, scope: !801, inlinedAt: !519)
!801 = distinct !DILexicalBlock(scope: !802, file: !3, line: 292, column: 13)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 287, column: 5)
!803 = distinct !DILexicalBlock(scope: !517, file: !3, line: 286, column: 5)
!804 = !DILocation(line: 292, column: 126, scope: !801, inlinedAt: !519)
!805 = !DILocation(line: 292, column: 136, scope: !801, inlinedAt: !519)
!806 = !DILocation(line: 292, column: 141, scope: !801, inlinedAt: !519)
!807 = !DILocation(line: 292, column: 13, scope: !802, inlinedAt: !519)
!808 = !DILocation(line: 295, column: 27, scope: !802, inlinedAt: !519)
!809 = !DILocation(line: 295, column: 9, scope: !802, inlinedAt: !519)
!810 = !DILocation(line: 295, column: 61, scope: !802, inlinedAt: !519)
!811 = !DILocation(line: 295, column: 46, scope: !802, inlinedAt: !519)
!812 = !DILocation(line: 286, column: 42, scope: !803, inlinedAt: !519)
!813 = !DILocation(line: 286, column: 23, scope: !803, inlinedAt: !519)
!814 = !DILocation(line: 286, column: 25, scope: !803, inlinedAt: !519)
!815 = distinct !{!815, !799, !816, !693}
!816 = !DILocation(line: 296, column: 5, scope: !517, inlinedAt: !519)
!817 = !DILocation(line: 298, column: 12, scope: !452, inlinedAt: !519)
!818 = !DILocation(line: 298, column: 5, scope: !452, inlinedAt: !519)
!819 = !DILocation(line: 299, column: 1, scope: !452, inlinedAt: !519)
!820 = !DILocation(line: 0, scope: !397, inlinedAt: !821)
!821 = distinct !DILocation(line: 431, column: 24, scope: !444)
!822 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !821)
!823 = !DILocation(line: 431, column: 17, scope: !444)
!824 = !DILocation(line: 437, column: 14, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 437, column: 13)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 436, column: 5)
!827 = distinct !DILexicalBlock(scope: !417, file: !3, line: 435, column: 14)
!828 = !DILocation(line: 437, column: 13, scope: !826)
!829 = !DILocation(line: 0, scope: !397, inlinedAt: !830)
!830 = distinct !DILocation(line: 438, column: 20, scope: !825)
!831 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !830)
!832 = !DILocation(line: 438, column: 13, scope: !825)
!833 = !DILocation(line: 440, column: 15, scope: !826)
!834 = !DILocation(line: 440, column: 25, scope: !826)
!835 = !{!836, !349, i64 0}
!836 = !{!"lpm_key_v6", !349, i64 0, !441, i64 4}
!837 = !DILocation(line: 441, column: 15, scope: !826)
!838 = !DILocation(line: 441, column: 27, scope: !826)
!839 = !{i64 0, i64 16, !634, i64 0, i64 16, !634, i64 0, i64 16, !634}
!840 = !DILocation(line: 442, column: 18, scope: !841)
!841 = distinct !DILexicalBlock(scope: !826, file: !3, line: 442, column: 13)
!842 = !DILocation(line: 442, column: 26, scope: !841)
!843 = !DILocation(line: 442, column: 13, scope: !826)
!844 = !DILocation(line: 445, column: 24, scope: !845)
!845 = distinct !DILexicalBlock(scope: !841, file: !3, line: 443, column: 9)
!846 = !DILocation(line: 446, column: 17, scope: !847)
!847 = distinct !DILexicalBlock(scope: !845, file: !3, line: 446, column: 17)
!848 = !DILocation(line: 446, column: 17, scope: !845)
!849 = !DILocation(line: 448, column: 35, scope: !850)
!850 = distinct !DILexicalBlock(scope: !847, file: !3, line: 447, column: 13)
!851 = !{!852, !349, i64 32}
!852 = !{!"end_function", !350, i64 0, !350, i64 16, !349, i64 32, !349, i64 36, !349, i64 40, !349, i64 44}
!853 = !DILocation(line: 448, column: 17, scope: !850)
!854 = !DILocalVariable(name: "xdp", arg: 1, scope: !855, file: !3, line: 13, type: !61)
!855 = distinct !DISubprogram(name: "action_end", scope: !3, file: !3, line: 13, type: !298, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !856)
!856 = !{!854, !857, !858}
!857 = !DILocalVariable(name: "srhdr", scope: !855, file: !3, line: 18, type: !464)
!858 = !DILocalVariable(name: "v6h", scope: !855, file: !3, line: 19, type: !328)
!859 = !DILocation(line: 0, scope: !855, inlinedAt: !860)
!860 = distinct !DILocation(line: 451, column: 59, scope: !861)
!861 = distinct !DILexicalBlock(scope: !850, file: !3, line: 449, column: 17)
!862 = !DILocalVariable(name: "xdp", arg: 1, scope: !863, file: !360, line: 297, type: !61)
!863 = distinct !DISubprogram(name: "get_and_validate_srh", scope: !360, file: !360, line: 297, type: !864, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!464, !61}
!866 = !{!862, !867}
!867 = !DILocalVariable(name: "srh", scope: !863, file: !360, line: 299, type: !464)
!868 = !DILocation(line: 0, scope: !863, inlinedAt: !869)
!869 = distinct !DILocation(line: 18, column: 28, scope: !855, inlinedAt: !860)
!870 = !DILocalVariable(name: "xdp", arg: 1, scope: !871, file: !360, line: 253, type: !61)
!871 = distinct !DISubprogram(name: "get_srh", scope: !360, file: !360, line: 253, type: !864, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !872)
!872 = !{!870, !873, !874, !875}
!873 = !DILocalVariable(name: "data", scope: !871, file: !360, line: 255, type: !53)
!874 = !DILocalVariable(name: "data_end", scope: !871, file: !360, line: 256, type: !53)
!875 = !DILocalVariable(name: "srh", scope: !871, file: !360, line: 258, type: !464)
!876 = !DILocation(line: 0, scope: !871, inlinedAt: !877)
!877 = distinct !DILocation(line: 301, column: 11, scope: !863, inlinedAt: !869)
!878 = !DILocation(line: 255, column: 37, scope: !871, inlinedAt: !877)
!879 = !DILocation(line: 255, column: 26, scope: !871, inlinedAt: !877)
!880 = !DILocation(line: 255, column: 18, scope: !871, inlinedAt: !877)
!881 = !DILocation(line: 256, column: 41, scope: !871, inlinedAt: !877)
!882 = !DILocation(line: 256, column: 30, scope: !871, inlinedAt: !877)
!883 = !DILocation(line: 262, column: 13, scope: !884, inlinedAt: !877)
!884 = distinct !DILexicalBlock(scope: !871, file: !360, line: 262, column: 9)
!885 = !DILocation(line: 262, column: 19, scope: !884, inlinedAt: !877)
!886 = !DILocation(line: 262, column: 17, scope: !884, inlinedAt: !877)
!887 = !DILocation(line: 262, column: 9, scope: !871, inlinedAt: !877)
!888 = !DILocation(line: 302, column: 10, scope: !889, inlinedAt: !869)
!889 = distinct !DILexicalBlock(scope: !863, file: !360, line: 302, column: 9)
!890 = !DILocation(line: 302, column: 9, scope: !863, inlinedAt: !869)
!891 = !DILocation(line: 305, column: 14, scope: !892, inlinedAt: !869)
!892 = distinct !DILexicalBlock(scope: !863, file: !360, line: 305, column: 9)
!893 = !DILocation(line: 305, column: 27, scope: !892, inlinedAt: !869)
!894 = !DILocation(line: 0, scope: !375, inlinedAt: !895)
!895 = distinct !DILocation(line: 19, column: 27, scope: !855, inlinedAt: !860)
!896 = !DILocation(line: 235, column: 13, scope: !385, inlinedAt: !895)
!897 = !DILocation(line: 235, column: 19, scope: !385, inlinedAt: !895)
!898 = !DILocation(line: 235, column: 17, scope: !385, inlinedAt: !895)
!899 = !DILocation(line: 235, column: 9, scope: !375, inlinedAt: !895)
!900 = !DILocation(line: 21, column: 10, scope: !901, inlinedAt: !860)
!901 = distinct !DILexicalBlock(scope: !855, file: !3, line: 21, column: 9)
!902 = !DILocation(line: 21, column: 16, scope: !901, inlinedAt: !860)
!903 = !DILocation(line: 24, column: 39, scope: !904, inlinedAt: !860)
!904 = distinct !DILexicalBlock(scope: !855, file: !3, line: 24, column: 9)
!905 = !DILocalVariable(name: "srh", arg: 1, scope: !906, file: !360, line: 317, type: !464)
!906 = distinct !DISubprogram(name: "advance_nextseg", scope: !360, file: !360, line: 317, type: !907, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !911)
!907 = !DISubroutineType(types: !908)
!908 = !{!909, !464, !71, !61}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !6, line: 79, baseType: !910)
!910 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!911 = !{!905, !912, !913, !914, !915}
!912 = !DILocalVariable(name: "daddr", arg: 2, scope: !906, file: !360, line: 317, type: !71)
!913 = !DILocalVariable(name: "xdp", arg: 3, scope: !906, file: !360, line: 317, type: !61)
!914 = !DILocalVariable(name: "addr", scope: !906, file: !360, line: 319, type: !71)
!915 = !DILocalVariable(name: "data_end", scope: !906, file: !360, line: 320, type: !53)
!916 = !DILocation(line: 0, scope: !906, inlinedAt: !917)
!917 = distinct !DILocation(line: 24, column: 10, scope: !904, inlinedAt: !860)
!918 = !DILocation(line: 320, column: 22, scope: !906, inlinedAt: !917)
!919 = !DILocation(line: 322, column: 10, scope: !906, inlinedAt: !917)
!920 = !DILocation(line: 322, column: 22, scope: !906, inlinedAt: !917)
!921 = !DILocation(line: 323, column: 27, scope: !922, inlinedAt: !917)
!922 = distinct !DILexicalBlock(scope: !906, file: !360, line: 323, column: 9)
!923 = !DILocation(line: 323, column: 80, scope: !922, inlinedAt: !917)
!924 = !DILocation(line: 323, column: 77, scope: !922, inlinedAt: !917)
!925 = !DILocation(line: 323, column: 51, scope: !922, inlinedAt: !917)
!926 = !DILocation(line: 323, column: 103, scope: !922, inlinedAt: !917)
!927 = !DILocation(line: 323, column: 9, scope: !906, inlinedAt: !917)
!928 = !DILocation(line: 326, column: 26, scope: !906, inlinedAt: !917)
!929 = !DILocation(line: 327, column: 14, scope: !930, inlinedAt: !917)
!930 = distinct !DILexicalBlock(scope: !906, file: !360, line: 327, column: 9)
!931 = !DILocation(line: 327, column: 20, scope: !930, inlinedAt: !917)
!932 = !DILocation(line: 327, column: 18, scope: !930, inlinedAt: !917)
!933 = !DILocation(line: 327, column: 9, scope: !906, inlinedAt: !917)
!934 = !DILocation(line: 330, column: 14, scope: !906, inlinedAt: !917)
!935 = !DILocation(line: 27, column: 12, scope: !855, inlinedAt: !860)
!936 = !DILocation(line: 27, column: 5, scope: !855, inlinedAt: !860)
!937 = !DILocation(line: 0, scope: !397, inlinedAt: !938)
!938 = distinct !DILocation(line: 451, column: 28, scope: !861)
!939 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !938)
!940 = !DILocation(line: 451, column: 21, scope: !861)
!941 = !DILocalVariable(name: "xdp", arg: 1, scope: !942, file: !3, line: 59, type: !61)
!942 = distinct !DISubprogram(name: "action_enddx4", scope: !3, file: !3, line: 59, type: !943, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !945)
!943 = !DISubroutineType(types: !944)
!944 = !{!60, !61, !171}
!945 = !{!941, !946, !947, !948}
!946 = !DILocalVariable(name: "ef", arg: 2, scope: !942, file: !3, line: 59, type: !171)
!947 = !DILocalVariable(name: "rc", scope: !942, file: !3, line: 61, type: !60)
!948 = !DILocalVariable(name: "iph", scope: !942, file: !3, line: 69, type: !313)
!949 = !DILocation(line: 0, scope: !942, inlinedAt: !950)
!950 = distinct !DILocation(line: 453, column: 59, scope: !861)
!951 = !DILocalVariable(name: "xdp", arg: 1, scope: !952, file: !3, line: 30, type: !61)
!952 = distinct !DISubprogram(name: "base_decap", scope: !3, file: !3, line: 30, type: !953, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!60, !61, !55}
!955 = !{!951, !956, !957, !958, !959, !960, !961}
!956 = !DILocalVariable(name: "proto", arg: 2, scope: !952, file: !3, line: 30, type: !55)
!957 = !DILocalVariable(name: "data_end", scope: !952, file: !3, line: 32, type: !53)
!958 = !DILocalVariable(name: "data", scope: !952, file: !3, line: 33, type: !53)
!959 = !DILocalVariable(name: "srh", scope: !952, file: !3, line: 35, type: !464)
!960 = !DILocalVariable(name: "v6h", scope: !952, file: !3, line: 36, type: !328)
!961 = !DILocalVariable(name: "new_eth", scope: !952, file: !3, line: 50, type: !305)
!962 = !DILocation(line: 0, scope: !952, inlinedAt: !963)
!963 = distinct !DILocation(line: 61, column: 14, scope: !942, inlinedAt: !950)
!964 = !DILocation(line: 0, scope: !871, inlinedAt: !965)
!965 = distinct !DILocation(line: 35, column: 26, scope: !952, inlinedAt: !963)
!966 = !DILocation(line: 255, column: 37, scope: !871, inlinedAt: !965)
!967 = !DILocation(line: 255, column: 26, scope: !871, inlinedAt: !965)
!968 = !DILocation(line: 255, column: 18, scope: !871, inlinedAt: !965)
!969 = !DILocation(line: 256, column: 41, scope: !871, inlinedAt: !965)
!970 = !DILocation(line: 256, column: 30, scope: !871, inlinedAt: !965)
!971 = !DILocation(line: 262, column: 13, scope: !884, inlinedAt: !965)
!972 = !DILocation(line: 262, column: 19, scope: !884, inlinedAt: !965)
!973 = !DILocation(line: 262, column: 17, scope: !884, inlinedAt: !965)
!974 = !DILocation(line: 262, column: 9, scope: !871, inlinedAt: !965)
!975 = !DILocation(line: 0, scope: !375, inlinedAt: !976)
!976 = distinct !DILocation(line: 36, column: 27, scope: !952, inlinedAt: !963)
!977 = !DILocation(line: 235, column: 13, scope: !385, inlinedAt: !976)
!978 = !DILocation(line: 235, column: 19, scope: !385, inlinedAt: !976)
!979 = !DILocation(line: 235, column: 17, scope: !385, inlinedAt: !976)
!980 = !DILocation(line: 235, column: 9, scope: !375, inlinedAt: !976)
!981 = !DILocation(line: 38, column: 10, scope: !982, inlinedAt: !963)
!982 = distinct !DILexicalBlock(scope: !952, file: !3, line: 38, column: 9)
!983 = !DILocation(line: 38, column: 14, scope: !982, inlinedAt: !963)
!984 = !DILocation(line: 43, column: 71, scope: !985, inlinedAt: !963)
!985 = distinct !DILexicalBlock(scope: !952, file: !3, line: 43, column: 9)
!986 = !DILocation(line: 43, column: 66, scope: !985, inlinedAt: !963)
!987 = !DILocation(line: 43, column: 86, scope: !985, inlinedAt: !963)
!988 = !DILocation(line: 43, column: 63, scope: !985, inlinedAt: !963)
!989 = !DILocation(line: 43, column: 9, scope: !985, inlinedAt: !963)
!990 = !DILocation(line: 43, column: 9, scope: !952, inlinedAt: !963)
!991 = !DILocation(line: 48, column: 40, scope: !952, inlinedAt: !963)
!992 = !DILocation(line: 48, column: 20, scope: !952, inlinedAt: !963)
!993 = !DILocation(line: 49, column: 44, scope: !952, inlinedAt: !963)
!994 = !DILocation(line: 49, column: 24, scope: !952, inlinedAt: !963)
!995 = !DILocation(line: 50, column: 30, scope: !952, inlinedAt: !963)
!996 = !DILocation(line: 51, column: 17, scope: !997, inlinedAt: !963)
!997 = distinct !DILexicalBlock(scope: !952, file: !3, line: 51, column: 9)
!998 = !DILocation(line: 51, column: 23, scope: !997, inlinedAt: !963)
!999 = !DILocation(line: 51, column: 21, scope: !997, inlinedAt: !963)
!1000 = !DILocation(line: 51, column: 9, scope: !952, inlinedAt: !963)
!1001 = !DILocation(line: 54, column: 14, scope: !952, inlinedAt: !963)
!1002 = !DILocation(line: 54, column: 22, scope: !952, inlinedAt: !963)
!1003 = !DILocation(line: 0, scope: !359, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 69, column: 25, scope: !942, inlinedAt: !950)
!1005 = !DILocation(line: 243, column: 18, scope: !359, inlinedAt: !1004)
!1006 = !DILocation(line: 247, column: 13, scope: !370, inlinedAt: !1004)
!1007 = !DILocation(line: 247, column: 19, scope: !370, inlinedAt: !1004)
!1008 = !DILocation(line: 247, column: 17, scope: !370, inlinedAt: !1004)
!1009 = !DILocation(line: 247, column: 9, scope: !359, inlinedAt: !1004)
!1010 = !DILocation(line: 71, column: 10, scope: !1011, inlinedAt: !950)
!1011 = distinct !DILexicalBlock(scope: !942, file: !3, line: 71, column: 9)
!1012 = !DILocation(line: 71, column: 9, scope: !942, inlinedAt: !950)
!1013 = !DILocation(line: 76, column: 33, scope: !942, inlinedAt: !950)
!1014 = !DILocation(line: 76, column: 10, scope: !942, inlinedAt: !950)
!1015 = !DILocation(line: 76, column: 16, scope: !942, inlinedAt: !950)
!1016 = !DILocalVariable(name: "iph", arg: 1, scope: !1017, file: !360, line: 192, type: !313)
!1017 = distinct !DISubprogram(name: "csum_build", scope: !360, file: !360, line: 192, type: !1018, scopeLine: 193, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !313}
!1020 = !{!1016, !1021, !1022, !1023}
!1021 = !DILocalVariable(name: "next_iph_u16", scope: !1017, file: !360, line: 194, type: !97)
!1022 = !DILocalVariable(name: "csum", scope: !1017, file: !360, line: 195, type: !65)
!1023 = !DILocalVariable(name: "i", scope: !1017, file: !360, line: 196, type: !60)
!1024 = !DILocation(line: 0, scope: !1017, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 77, column: 5, scope: !942, inlinedAt: !950)
!1026 = !DILocation(line: 197, column: 10, scope: !1017, inlinedAt: !1025)
!1027 = !DILocation(line: 197, column: 16, scope: !1017, inlinedAt: !1025)
!1028 = !{!429, !412, i64 10}
!1029 = !DILocation(line: 198, column: 20, scope: !1017, inlinedAt: !1025)
!1030 = !DILocation(line: 200, column: 5, scope: !1031, inlinedAt: !1025)
!1031 = distinct !DILexicalBlock(scope: !1017, file: !360, line: 200, column: 5)
!1032 = !DILocation(line: 201, column: 30, scope: !1033, inlinedAt: !1025)
!1033 = distinct !DILexicalBlock(scope: !1031, file: !360, line: 200, column: 5)
!1034 = !DILocation(line: 201, column: 17, scope: !1033, inlinedAt: !1025)
!1035 = !{!412, !412, i64 0}
!1036 = !DILocation(line: 201, column: 14, scope: !1033, inlinedAt: !1025)
!1037 = !DILocation(line: 200, column: 43, scope: !1033, inlinedAt: !1025)
!1038 = !DILocation(line: 200, column: 19, scope: !1033, inlinedAt: !1025)
!1039 = distinct !{!1039, !1030, !1040, !693}
!1040 = !DILocation(line: 201, column: 30, scope: !1031, inlinedAt: !1025)
!1041 = !DILocation(line: 203, column: 44, scope: !1017, inlinedAt: !1025)
!1042 = !DILocation(line: 203, column: 36, scope: !1017, inlinedAt: !1025)
!1043 = !DILocation(line: 203, column: 18, scope: !1017, inlinedAt: !1025)
!1044 = !DILocation(line: 203, column: 16, scope: !1017, inlinedAt: !1025)
!1045 = !DILocation(line: 78, column: 12, scope: !942, inlinedAt: !950)
!1046 = !DILocation(line: 78, column: 5, scope: !942, inlinedAt: !950)
!1047 = !DILocation(line: 0, scope: !397, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 453, column: 28, scope: !861)
!1049 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !1048)
!1050 = !DILocation(line: 453, column: 21, scope: !861)
!1051 = !DILocalVariable(name: "xdp", arg: 1, scope: !1052, file: !3, line: 302, type: !61)
!1052 = distinct !DISubprogram(name: "action_end_m_gtp4_e", scope: !3, file: !3, line: 302, type: !943, scopeLine: 303, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1053)
!1053 = !{!1051, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1054 = !DILocalVariable(name: "ef", arg: 2, scope: !1052, file: !3, line: 302, type: !171)
!1055 = !DILocalVariable(name: "data_end", scope: !1052, file: !3, line: 304, type: !53)
!1056 = !DILocalVariable(name: "data", scope: !1052, file: !3, line: 305, type: !53)
!1057 = !DILocalVariable(name: "srh", scope: !1052, file: !3, line: 307, type: !464)
!1058 = !DILocalVariable(name: "v6h", scope: !1052, file: !3, line: 308, type: !328)
!1059 = !DILocalVariable(name: "payload_len", scope: !1052, file: !3, line: 309, type: !55)
!1060 = !DILocalVariable(name: "tot_len", scope: !1052, file: !3, line: 309, type: !55)
!1061 = !DILocalVariable(name: "v6taple_key", scope: !1052, file: !3, line: 314, type: !60)
!1062 = !DILocalVariable(name: "map_addr_taple", scope: !1052, file: !3, line: 315, type: !251)
!1063 = !DILocalVariable(name: "new_eth", scope: !1052, file: !3, line: 334, type: !305)
!1064 = !DILocalVariable(name: "new_iph", scope: !1052, file: !3, line: 335, type: !313)
!1065 = !DILocalVariable(name: "new_uh", scope: !1052, file: !3, line: 336, type: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !6, line: 43689, size: 64, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1067, file: !6, line: 43690, baseType: !85, size: 16)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1067, file: !6, line: 43691, baseType: !85, size: 16, offset: 16)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1067, file: !6, line: 43692, baseType: !85, size: 16, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1067, file: !6, line: 43693, baseType: !94, size: 16, offset: 48)
!1073 = !DILocalVariable(name: "new_gtp1", scope: !1052, file: !3, line: 337, type: !485)
!1074 = !DILocalVariable(name: "args", scope: !1052, file: !3, line: 356, type: !495)
!1075 = !DILocalVariable(name: "s_offset", scope: !1052, file: !3, line: 358, type: !55)
!1076 = !DILocalVariable(name: "s_shift", scope: !1052, file: !3, line: 358, type: !55)
!1077 = !DILocalVariable(name: "d_offset", scope: !1052, file: !3, line: 358, type: !55)
!1078 = !DILocalVariable(name: "d_shift", scope: !1052, file: !3, line: 358, type: !55)
!1079 = !DILocalVariable(name: "src_p", scope: !1052, file: !3, line: 365, type: !96)
!1080 = !DILocalVariable(name: "dst_p", scope: !1052, file: !3, line: 365, type: !96)
!1081 = !DILocalVariable(name: "args_p", scope: !1052, file: !3, line: 365, type: !96)
!1082 = !DILocation(line: 0, scope: !1052, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 455, column: 59, scope: !861)
!1084 = !DILocation(line: 0, scope: !871, inlinedAt: !1085)
!1085 = distinct !DILocation(line: 307, column: 26, scope: !1052, inlinedAt: !1083)
!1086 = !DILocation(line: 255, column: 37, scope: !871, inlinedAt: !1085)
!1087 = !DILocation(line: 255, column: 26, scope: !871, inlinedAt: !1085)
!1088 = !DILocation(line: 255, column: 18, scope: !871, inlinedAt: !1085)
!1089 = !DILocation(line: 256, column: 41, scope: !871, inlinedAt: !1085)
!1090 = !DILocation(line: 256, column: 30, scope: !871, inlinedAt: !1085)
!1091 = !DILocation(line: 262, column: 13, scope: !884, inlinedAt: !1085)
!1092 = !DILocation(line: 262, column: 19, scope: !884, inlinedAt: !1085)
!1093 = !DILocation(line: 262, column: 17, scope: !884, inlinedAt: !1085)
!1094 = !DILocation(line: 262, column: 9, scope: !871, inlinedAt: !1085)
!1095 = !DILocation(line: 0, scope: !375, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 308, column: 27, scope: !1052, inlinedAt: !1083)
!1097 = !DILocation(line: 235, column: 13, scope: !385, inlinedAt: !1096)
!1098 = !DILocation(line: 235, column: 19, scope: !385, inlinedAt: !1096)
!1099 = !DILocation(line: 235, column: 17, scope: !385, inlinedAt: !1096)
!1100 = !DILocation(line: 235, column: 9, scope: !375, inlinedAt: !1096)
!1101 = !DILocation(line: 311, column: 10, scope: !1102, inlinedAt: !1083)
!1102 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 311, column: 9)
!1103 = !DILocation(line: 311, column: 14, scope: !1102, inlinedAt: !1083)
!1104 = !DILocation(line: 314, column: 5, scope: !1052, inlinedAt: !1083)
!1105 = !DILocation(line: 314, column: 9, scope: !1052, inlinedAt: !1083)
!1106 = !{!349, !349, i64 0}
!1107 = !DILocation(line: 315, column: 42, scope: !1052, inlinedAt: !1083)
!1108 = !DILocation(line: 316, column: 10, scope: !1109, inlinedAt: !1083)
!1109 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 316, column: 9)
!1110 = !DILocation(line: 316, column: 9, scope: !1052, inlinedAt: !1083)
!1111 = !DILocation(line: 319, column: 21, scope: !1052, inlinedAt: !1083)
!1112 = !DILocation(line: 319, column: 34, scope: !1052, inlinedAt: !1083)
!1113 = !DILocation(line: 320, column: 21, scope: !1052, inlinedAt: !1083)
!1114 = !DILocation(line: 320, column: 34, scope: !1052, inlinedAt: !1083)
!1115 = !DILocation(line: 323, column: 19, scope: !1052, inlinedAt: !1083)
!1116 = !DILocation(line: 323, column: 55, scope: !1052, inlinedAt: !1083)
!1117 = !DILocation(line: 323, column: 50, scope: !1052, inlinedAt: !1083)
!1118 = !DILocation(line: 323, column: 70, scope: !1052, inlinedAt: !1083)
!1119 = !DILocation(line: 325, column: 63, scope: !1120, inlinedAt: !1083)
!1120 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 325, column: 9)
!1121 = !DILocation(line: 325, column: 9, scope: !1120, inlinedAt: !1083)
!1122 = !DILocation(line: 325, column: 9, scope: !1052, inlinedAt: !1083)
!1123 = !DILocation(line: 328, column: 9, scope: !1124, inlinedAt: !1083)
