; ModuleID = 'srv6.c'
source_filename = "srv6.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.xdpcap_hook = type { [3 x i32]*, [4 x i32]*, [4 x i32]*, [5 x i32]* }
%struct.anon = type { [11 x i32]*, %struct.lpm_key_v4*, %struct.transit_behavior*, [256 x i32]*, [1 x i32]* }
%struct.lpm_key_v4 = type { i32, i32 }
%struct.transit_behavior = type { %struct.in6_addr, %struct.in6_addr, i32, i32, i32, i32, [5 x %struct.in6_addr] }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.anon.1 = type { [11 x i32]*, %struct.lpm_key_v6*, %struct.end_function*, [65536 x i32]*, [1 x i32]* }
%struct.lpm_key_v6 = type { i32, %struct.in6_addr }
%struct.end_function = type { [4 x i32], %union.anon.0, i32, i32, i32, i32 }
%union.anon.0 = type { [4 x i32] }
%struct.anon.2 = type { [11 x i32]*, %struct.lpm_key_v6*, %struct.transit_behavior*, [256 x i32]*, [1 x i32]* }
%struct.anon.3 = type { [14 x i32]*, [4 x i32]*, [4 x i32]*, [64 x i32]* }
%struct.anon.4 = type { [6 x i32]*, i32*, %struct.v6addr_heep*, [1 x i32]* }
%struct.v6addr_heep = type { %struct.in6_addr, %struct.in6_addr }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.5, %union.anon.6, %union.anon.7, i16, i16, [6 x i8], [6 x i8] }
%union.anon.5 = type { i32 }
%union.anon.6 = type { [4 x i32] }
%union.anon.7 = type { [4 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdpcap_hook", scope: !2, file: !137, line: 62, type: !283, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Debian clang version 11.0.1-2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !130, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "srv6.c", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!4 = !{!5, !14, !44, !48}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 29782, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./../common/vmlinux.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 33712, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262, isUnsigned: true)
!43 = !DIEnumerator(name: "IPPROTO_MAX", value: 263, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 90510, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47}
!46 = !DIEnumerator(name: "BPF_FIB_LOOKUP_DIRECT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "BPF_FIB_LOOKUP_OUTPUT", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 36, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51}
!50 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!52 = !{!53, !54, !55, !57, !60, !71, !93, !65, !94, !95, !96, !97, !98, !109, !115}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 12, baseType: !56)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61, !53, !60}
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 32700, size: 192, elements: !63)
!63 = !{!64, !66, !67, !68, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !6, line: 32701, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 16, baseType: !7)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !62, file: !6, line: 32702, baseType: !65, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !62, file: !6, line: 32703, baseType: !65, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !62, file: !6, line: 32704, baseType: !65, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !62, file: !6, line: 32705, baseType: !65, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !62, file: !6, line: 32706, baseType: !65, size: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !6, line: 7911, size: 128, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !72, file: !6, line: 7916, baseType: !75, size: 128)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !72, file: !6, line: 7912, size: 128, elements: !76)
!76 = !{!77, !83, !88}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !75, file: !6, line: 7913, baseType: !78, size: 128)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !81)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 10, baseType: !80)
!80 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !{!82}
!82 = !DISubrange(count: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !75, file: !6, line: 7914, baseType: !84, size: 128)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 7670, baseType: !55)
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !75, file: !6, line: 7915, baseType: !89, size: 128)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !91)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !6, line: 7672, baseType: !65)
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !6, line: 43298, baseType: !55)
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !6, line: 90534, size: 32, elements: !126)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 90527, size: 512, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !114, !119, !120, !121, !125}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !99, file: !6, line: 90528, baseType: !79, size: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !99, file: !6, line: 90529, baseType: !79, size: 8, offset: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !99, file: !6, line: 90530, baseType: !85, size: 16, offset: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !99, file: !6, line: 90531, baseType: !85, size: 16, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !99, file: !6, line: 90532, baseType: !55, size: 16, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !99, file: !6, line: 90533, baseType: !65, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !6, line: 90534, baseType: !98, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !6, line: 90539, baseType: !109, size: 128, offset: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !6, line: 90539, size: 128, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !109, file: !6, line: 90540, baseType: !90, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !109, file: !6, line: 90541, baseType: !113, size: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !91)
!114 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !6, line: 90543, baseType: !115, size: 128, offset: 256)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !6, line: 90543, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !115, file: !6, line: 90544, baseType: !90, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !115, file: !6, line: 90545, baseType: !113, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !99, file: !6, line: 90547, baseType: !85, size: 16, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !99, file: !6, line: 90548, baseType: !85, size: 16, offset: 400)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !99, file: !6, line: 90549, baseType: !122, size: 48, offset: 416)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 6)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !99, file: !6, line: 90550, baseType: !122, size: 48, offset: 464)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !98, file: !6, line: 90535, baseType: !79, size: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !98, file: !6, line: 90536, baseType: !90, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !98, file: !6, line: 90537, baseType: !65, size: 32)
!130 = !{!131, !135, !154, !201, !232, !241, !0, !257, !265, !270, !276}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 485, type: !133, isLocal: false, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !91)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !137, line: 17, type: !138, isLocal: false, isDefinition: true)
!137 = !DIFile(filename: "./srv6_maps.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 11, size: 256, elements: !139)
!139 = !{!140, !145, !148, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !137, line: 13, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 448, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 14)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !138, file: !137, line: 14, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !91)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !138, file: !137, line: 15, baseType: !146, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !138, file: !137, line: 16, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 64)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "function_table", scope: !2, file: !137, line: 26, type: !156, isLocal: false, isDefinition: true)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 19, size: 320, elements: !157)
!157 = !{!158, !163, !170, !191, !196}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !137, line: 21, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 352, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 11)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !156, file: !137, line: 22, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpm_key_v6", file: !166, line: 32, size: 160, elements: !167)
!166 = !DIFile(filename: "./srv6_structs.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !165, file: !166, line: 34, baseType: !65, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !166, line: 35, baseType: !72, size: 128, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !156, file: !137, line: 23, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end_function", file: !166, line: 38, size: 384, elements: !173)
!173 = !{!174, !175, !187, !188, !189, !190}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !172, file: !166, line: 40, baseType: !113, size: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nexthop", scope: !172, file: !166, line: 49, baseType: !176, size: 128, offset: 128)
!176 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !172, file: !166, line: 41, size: 128, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v6addr", scope: !176, file: !166, line: 43, baseType: !113, size: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !176, file: !166, line: 48, baseType: !180, size: 128)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4", file: !166, line: 44, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !180, file: !166, line: 46, baseType: !65, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !180, file: !166, line: 47, baseType: !184, size: 96, offset: 32)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 3)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !172, file: !166, line: 52, baseType: !65, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flaver", scope: !172, file: !166, line: 53, baseType: !65, size: 32, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v4_addr_spos", scope: !172, file: !166, line: 54, baseType: !65, size: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v4_addr_dpos", scope: !172, file: !166, line: 55, baseType: !65, size: 32, offset: 352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !156, file: !137, line: 24, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2097152, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 65536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !156, file: !137, line: 25, baseType: !197, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 1)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "transit_table_v4", scope: !2, file: !137, line: 35, type: !203, isLocal: false, isDefinition: true)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 28, size: 320, elements: !204)
!204 = !{!205, !206, !212, !226, !231}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !137, line: 30, baseType: !159, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !203, file: !137, line: 31, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpm_key_v4", file: !166, line: 26, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !208, file: !166, line: 28, baseType: !65, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !208, file: !166, line: 29, baseType: !65, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !137, line: 32, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "transit_behavior", file: !166, line: 15, size: 1024, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !214, file: !166, line: 17, baseType: !72, size: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !214, file: !166, line: 18, baseType: !72, size: 128, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "s_prefixlen", scope: !214, file: !166, line: 19, baseType: !65, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "d_prefixlen", scope: !214, file: !166, line: 20, baseType: !65, size: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "segment_length", scope: !214, file: !166, line: 21, baseType: !65, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !214, file: !166, line: 22, baseType: !65, size: 32, offset: 352)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !214, file: !166, line: 23, baseType: !223, size: 640, offset: 384)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 640, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 5)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !203, file: !137, line: 33, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !203, file: !137, line: 34, baseType: !197, size: 64, offset: 256)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "transit_table_v6", scope: !2, file: !137, line: 44, type: !234, isLocal: false, isDefinition: true)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 37, size: 320, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !137, line: 39, baseType: !159, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !234, file: !137, line: 40, baseType: !164, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !137, line: 41, baseType: !213, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !234, file: !137, line: 42, baseType: !227, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !234, file: !137, line: 43, baseType: !197, size: 64, offset: 256)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "in_taple_v6_addr", scope: !2, file: !137, line: 52, type: !243, isLocal: false, isDefinition: true)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 46, size: 256, elements: !244)
!244 = !{!245, !248, !250, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !137, line: 48, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 192, elements: !123)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !243, file: !137, line: 49, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !243, file: !137, line: 50, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v6addr_heep", file: !166, line: 9, size: 256, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !252, file: !166, line: 11, baseType: !72, size: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !252, file: !166, line: 12, baseType: !72, size: 128, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !243, file: !137, line: 51, baseType: !197, size: 64, offset: 192)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !259, line: 52, type: !260, isLocal: true, isDefinition: true)
!259 = !DIFile(filename: "./../common/bpf_helper_defs.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!53, !53, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !259, line: 1121, type: !267, isLocal: true, isDefinition: true)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!54, !61, !60}
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !259, line: 1817, type: !272, isLocal: true, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!54, !53, !275, !60, !65}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !259, line: 1297, type: !278, isLocal: true, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!54, !53, !65, !281}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !6, line: 20, baseType: !282)
!282 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdpcap_hook", file: !137, line: 56, size: 256, elements: !284)
!284 = !{!285, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !137, line: 58, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 96, elements: !185)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !283, file: !137, line: 59, baseType: !146, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !283, file: !137, line: 60, baseType: !146, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !283, file: !137, line: 61, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !224)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{!"Debian clang version 11.0.1-2"}
!297 = distinct !DISubprogram(name: "srv6_handler", scope: !3, file: !3, line: 395, type: !298, scopeLine: 396, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!60, !61}
!300 = !{!301, !302, !303, !304, !312, !327, !340, !341, !342, !343, !344}
!301 = !DILocalVariable(name: "xdp", arg: 1, scope: !297, file: !3, line: 395, type: !61)
!302 = !DILocalVariable(name: "data", scope: !297, file: !3, line: 398, type: !53)
!303 = !DILocalVariable(name: "data_end", scope: !297, file: !3, line: 399, type: !53)
!304 = !DILocalVariable(name: "eth", scope: !297, file: !3, line: 400, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !6, line: 10332, size: 112, elements: !307)
!307 = !{!308, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !306, file: !6, line: 10333, baseType: !309, size: 48)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 48, elements: !123)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !306, file: !6, line: 10334, baseType: !309, size: 48, offset: 48)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !306, file: !6, line: 10335, baseType: !85, size: 16, offset: 96)
!312 = !DILocalVariable(name: "iph", scope: !297, file: !3, line: 401, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !6, line: 43652, size: 160, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !314, file: !6, line: 43653, baseType: !79, size: 4, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !314, file: !6, line: 43654, baseType: !79, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !314, file: !6, line: 43655, baseType: !79, size: 8, offset: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !314, file: !6, line: 43656, baseType: !85, size: 16, offset: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !314, file: !6, line: 43657, baseType: !85, size: 16, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !314, file: !6, line: 43658, baseType: !85, size: 16, offset: 48)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !314, file: !6, line: 43659, baseType: !79, size: 8, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !314, file: !6, line: 43660, baseType: !79, size: 8, offset: 72)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !314, file: !6, line: 43661, baseType: !94, size: 16, offset: 80)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !314, file: !6, line: 43662, baseType: !90, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !314, file: !6, line: 43663, baseType: !90, size: 32, offset: 128)
!327 = !DILocalVariable(name: "v6h", scope: !297, file: !3, line: 402, type: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !6, line: 43678, size: 320, elements: !330)
!330 = !{!331, !332, !333, !335, !336, !337, !338, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !329, file: !6, line: 43679, baseType: !79, size: 4, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !329, file: !6, line: 43680, baseType: !79, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !329, file: !6, line: 43681, baseType: !334, size: 24, offset: 8)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 24, elements: !185)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !329, file: !6, line: 43682, baseType: !85, size: 16, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !329, file: !6, line: 43683, baseType: !79, size: 8, offset: 48)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !329, file: !6, line: 43684, baseType: !79, size: 8, offset: 56)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !329, file: !6, line: 43685, baseType: !72, size: 128, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !329, file: !6, line: 43686, baseType: !72, size: 128, offset: 192)
!340 = !DILocalVariable(name: "ef_table", scope: !297, file: !3, line: 403, type: !171)
!341 = !DILocalVariable(name: "tb", scope: !297, file: !3, line: 404, type: !213)
!342 = !DILocalVariable(name: "v4key", scope: !297, file: !3, line: 405, type: !208)
!343 = !DILocalVariable(name: "v6key", scope: !297, file: !3, line: 406, type: !165)
!344 = !DILocalVariable(name: "h_proto", scope: !297, file: !3, line: 407, type: !55)
!345 = !DILocation(line: 0, scope: !297)
!346 = !DILocation(line: 398, column: 37, scope: !297)
!347 = !{!348, !349, i64 0}
!348 = !{!"xdp_md", !349, i64 0, !349, i64 4, !349, i64 8, !349, i64 12, !349, i64 16, !349, i64 20}
!349 = !{!"int", !350, i64 0}
!350 = !{!"omnipotent char", !351, i64 0}
!351 = !{!"Simple C/C++ TBAA"}
!352 = !DILocation(line: 398, column: 26, scope: !297)
!353 = !DILocation(line: 398, column: 18, scope: !297)
!354 = !DILocation(line: 399, column: 41, scope: !297)
!355 = !{!348, !349, i64 4}
!356 = !DILocation(line: 399, column: 30, scope: !297)
!357 = !DILocation(line: 399, column: 22, scope: !297)
!358 = !DILocalVariable(name: "xdp", arg: 1, scope: !359, file: !360, line: 251, type: !61)
!359 = distinct !DISubprogram(name: "get_ipv4", scope: !360, file: !360, line: 251, type: !361, scopeLine: 252, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !363)
!360 = !DIFile(filename: "./srv6_helpers.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!361 = !DISubroutineType(types: !362)
!362 = !{!313, !61}
!363 = !{!358, !364, !365, !366}
!364 = !DILocalVariable(name: "data", scope: !359, file: !360, line: 253, type: !53)
!365 = !DILocalVariable(name: "data_end", scope: !359, file: !360, line: 254, type: !53)
!366 = !DILocalVariable(name: "iph", scope: !359, file: !360, line: 256, type: !313)
!367 = !DILocation(line: 0, scope: !359, inlinedAt: !368)
!368 = distinct !DILocation(line: 401, column: 25, scope: !297)
!369 = !DILocation(line: 257, column: 13, scope: !370, inlinedAt: !368)
!370 = distinct !DILexicalBlock(scope: !359, file: !360, line: 257, column: 9)
!371 = !DILocation(line: 257, column: 19, scope: !370, inlinedAt: !368)
!372 = !DILocation(line: 257, column: 17, scope: !370, inlinedAt: !368)
!373 = !DILocation(line: 257, column: 9, scope: !359, inlinedAt: !368)
!374 = !DILocalVariable(name: "xdp", arg: 1, scope: !375, file: !360, line: 238, type: !61)
!375 = distinct !DISubprogram(name: "get_ipv6", scope: !360, file: !360, line: 238, type: !376, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!328, !61}
!378 = !{!374, !379, !380, !381}
!379 = !DILocalVariable(name: "data", scope: !375, file: !360, line: 240, type: !53)
!380 = !DILocalVariable(name: "data_end", scope: !375, file: !360, line: 241, type: !53)
!381 = !DILocalVariable(name: "v6h", scope: !375, file: !360, line: 243, type: !328)
!382 = !DILocation(line: 0, scope: !375, inlinedAt: !383)
!383 = distinct !DILocation(line: 402, column: 27, scope: !297)
!384 = !DILocation(line: 245, column: 13, scope: !385, inlinedAt: !383)
!385 = distinct !DILexicalBlock(scope: !375, file: !360, line: 245, column: 9)
!386 = !DILocation(line: 245, column: 19, scope: !385, inlinedAt: !383)
!387 = !DILocation(line: 245, column: 17, scope: !385, inlinedAt: !383)
!388 = !DILocation(line: 245, column: 9, scope: !375, inlinedAt: !383)
!389 = !DILocation(line: 405, column: 5, scope: !297)
!390 = !DILocation(line: 405, column: 23, scope: !297)
!391 = !DILocation(line: 406, column: 5, scope: !297)
!392 = !DILocation(line: 406, column: 23, scope: !297)
!393 = !DILocation(line: 409, column: 29, scope: !394)
!394 = distinct !DILexicalBlock(scope: !297, file: !3, line: 409, column: 9)
!395 = !DILocation(line: 409, column: 9, scope: !297)
!396 = !DILocalVariable(name: "ctx", arg: 1, scope: !397, file: !398, line: 29, type: !61)
!397 = distinct !DISubprogram(name: "xdpcap_exit", scope: !398, file: !398, line: 29, type: !399, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !401)
!398 = !DIFile(filename: "./hook.h", directory: "/root/workspace/go/src/github.com/laik/ebpf-app/ebpf/srv6")
!399 = !DISubroutineType(types: !400)
!400 = !{!5, !61, !53, !5}
!401 = !{!396, !402, !403}
!402 = !DILocalVariable(name: "hook_map", arg: 2, scope: !397, file: !398, line: 29, type: !53)
!403 = !DILocalVariable(name: "action", arg: 3, scope: !397, file: !398, line: 29, type: !5)
!404 = !DILocation(line: 0, scope: !397, inlinedAt: !405)
!405 = distinct !DILocation(line: 410, column: 16, scope: !394)
!406 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !405)
!407 = !DILocation(line: 410, column: 9, scope: !394)
!408 = !DILocation(line: 400, column: 26, scope: !297)
!409 = !DILocation(line: 412, column: 20, scope: !297)
!410 = !{!411, !412, i64 12}
!411 = !{!"ethhdr", !350, i64 0, !350, i64 6, !412, i64 12}
!412 = !{!"short", !350, i64 0}
!413 = !DILocation(line: 413, column: 9, scope: !297)
!414 = !DILocation(line: 415, column: 14, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !3, line: 415, column: 13)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 414, column: 5)
!417 = distinct !DILexicalBlock(scope: !297, file: !3, line: 413, column: 9)
!418 = !DILocation(line: 415, column: 13, scope: !416)
!419 = !DILocation(line: 0, scope: !397, inlinedAt: !420)
!420 = distinct !DILocation(line: 416, column: 20, scope: !415)
!421 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !420)
!422 = !DILocation(line: 416, column: 13, scope: !415)
!423 = !DILocation(line: 418, column: 15, scope: !416)
!424 = !DILocation(line: 418, column: 25, scope: !416)
!425 = !{!426, !349, i64 0}
!426 = !{!"lpm_key_v4", !349, i64 0, !349, i64 4}
!427 = !DILocation(line: 419, column: 27, scope: !416)
!428 = !{!429, !349, i64 16}
!429 = !{!"iphdr", !350, i64 0, !350, i64 0, !350, i64 1, !412, i64 2, !412, i64 4, !412, i64 6, !350, i64 8, !350, i64 9, !412, i64 10, !349, i64 12, !349, i64 16}
!430 = !DILocation(line: 419, column: 15, scope: !416)
!431 = !DILocation(line: 419, column: 20, scope: !416)
!432 = !{!426, !349, i64 4}
!433 = !DILocation(line: 421, column: 14, scope: !416)
!434 = !DILocation(line: 422, column: 13, scope: !435)
!435 = distinct !DILexicalBlock(scope: !416, file: !3, line: 422, column: 13)
!436 = !DILocation(line: 422, column: 13, scope: !416)
!437 = !DILocation(line: 425, column: 25, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 423, column: 9)
!439 = !{!440, !349, i64 44}
!440 = !{!"transit_behavior", !441, i64 0, !441, i64 16, !349, i64 32, !349, i64 36, !349, i64 40, !349, i64 44, !350, i64 48}
!441 = !{!"in6_addr", !350, i64 0}
!442 = !DILocation(line: 425, column: 13, scope: !438)
!443 = !DILocation(line: 428, column: 92, scope: !444)
!444 = distinct !DILexicalBlock(scope: !438, file: !3, line: 426, column: 13)
!445 = !{!429, !412, i64 2}
!446 = !DILocalVariable(name: "xdp", arg: 1, scope: !447, file: !3, line: 148, type: !61)
!447 = distinct !DISubprogram(name: "transit_encap", scope: !3, file: !3, line: 148, type: !448, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !450)
!448 = !DISubroutineType(types: !449)
!449 = !{!60, !61, !213, !79, !79}
!450 = !{!446, !451, !452, !453, !454}
!451 = !DILocalVariable(name: "tb", arg: 2, scope: !447, file: !3, line: 148, type: !213)
!452 = !DILocalVariable(name: "nexthdr", arg: 3, scope: !447, file: !3, line: 148, type: !79)
!453 = !DILocalVariable(name: "innerlen", arg: 4, scope: !447, file: !3, line: 148, type: !79)
!454 = !DILocalVariable(name: "rc", scope: !447, file: !3, line: 150, type: !60)
!455 = !DILocation(line: 0, scope: !447, inlinedAt: !456)
!456 = distinct !DILocation(line: 428, column: 55, scope: !444)
!457 = !DILocalVariable(name: "xdp", arg: 1, scope: !458, file: !3, line: 81, type: !61)
!458 = distinct !DISubprogram(name: "base_encap", scope: !3, file: !3, line: 81, type: !459, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !461)
!459 = !DISubroutineType(types: !460)
!460 = !{!60, !61, !213, !79, !55}
!461 = !{!457, !462, !463, !464, !465, !466, !467, !468, !483, !484, !485}
!462 = !DILocalVariable(name: "tb", arg: 2, scope: !458, file: !3, line: 81, type: !213)
!463 = !DILocalVariable(name: "nexthdr", arg: 3, scope: !458, file: !3, line: 81, type: !79)
!464 = !DILocalVariable(name: "innerlen", arg: 4, scope: !458, file: !3, line: 81, type: !55)
!465 = !DILocalVariable(name: "data", scope: !458, file: !3, line: 83, type: !53)
!466 = !DILocalVariable(name: "data_end", scope: !458, file: !3, line: 84, type: !53)
!467 = !DILocalVariable(name: "v6h", scope: !458, file: !3, line: 86, type: !328)
!468 = !DILocalVariable(name: "srh", scope: !458, file: !3, line: 87, type: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "srhhdr", file: !166, line: 60, size: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nextHdr", scope: !470, file: !166, line: 62, baseType: !79, size: 8)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hdrExtLen", scope: !470, file: !166, line: 63, baseType: !79, size: 8, offset: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "routingType", scope: !470, file: !166, line: 64, baseType: !79, size: 8, offset: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "segmentsLeft", scope: !470, file: !166, line: 65, baseType: !79, size: 8, offset: 24)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lastEntry", scope: !470, file: !166, line: 66, baseType: !79, size: 8, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !166, line: 67, baseType: !79, size: 8, offset: 40)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !470, file: !166, line: 68, baseType: !55, size: 16, offset: 48)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !470, file: !166, line: 71, baseType: !480, offset: 64)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 0)
!483 = !DILocalVariable(name: "srh_len", scope: !458, file: !3, line: 88, type: !79)
!484 = !DILocalVariable(name: "new_eth", scope: !458, file: !3, line: 97, type: !305)
!485 = !DILocalVariable(name: "i", scope: !486, file: !3, line: 134, type: !65)
!486 = distinct !DILexicalBlock(scope: !458, file: !3, line: 134, column: 5)
!487 = !DILocation(line: 0, scope: !458, inlinedAt: !488)
!488 = distinct !DILocation(line: 150, column: 14, scope: !447, inlinedAt: !456)
!489 = !DILocation(line: 90, column: 69, scope: !458, inlinedAt: !488)
!490 = !{!440, !349, i64 40}
!491 = !DILocation(line: 90, column: 65, scope: !458, inlinedAt: !488)
!492 = !DILocation(line: 90, column: 63, scope: !458, inlinedAt: !488)
!493 = !DILocation(line: 90, column: 37, scope: !458, inlinedAt: !488)
!494 = !DILocation(line: 91, column: 69, scope: !495, inlinedAt: !488)
!495 = distinct !DILexicalBlock(scope: !458, file: !3, line: 91, column: 9)
!496 = !DILocation(line: 91, column: 67, scope: !495, inlinedAt: !488)
!497 = !DILocation(line: 91, column: 36, scope: !495, inlinedAt: !488)
!498 = !DILocation(line: 91, column: 9, scope: !495, inlinedAt: !488)
!499 = !DILocation(line: 91, column: 9, scope: !458, inlinedAt: !488)
!500 = !DILocation(line: 94, column: 31, scope: !458, inlinedAt: !488)
!501 = !DILocation(line: 94, column: 20, scope: !458, inlinedAt: !488)
!502 = !DILocation(line: 95, column: 35, scope: !458, inlinedAt: !488)
!503 = !DILocation(line: 95, column: 24, scope: !458, inlinedAt: !488)
!504 = !DILocation(line: 95, column: 16, scope: !458, inlinedAt: !488)
!505 = !DILocation(line: 100, column: 32, scope: !506, inlinedAt: !488)
!506 = distinct !DILexicalBlock(scope: !458, file: !3, line: 100, column: 9)
!507 = !DILocation(line: 100, column: 9, scope: !506, inlinedAt: !488)
!508 = !DILocation(line: 100, column: 57, scope: !506, inlinedAt: !488)
!509 = !DILocation(line: 100, column: 9, scope: !458, inlinedAt: !488)
!510 = !DILocation(line: 98, column: 15, scope: !458, inlinedAt: !488)
!511 = !DILocation(line: 94, column: 12, scope: !458, inlinedAt: !488)
!512 = !DILocation(line: 103, column: 14, scope: !458, inlinedAt: !488)
!513 = !DILocation(line: 103, column: 22, scope: !458, inlinedAt: !488)
!514 = !DILocation(line: 105, column: 24, scope: !458, inlinedAt: !488)
!515 = !DILocation(line: 105, column: 11, scope: !458, inlinedAt: !488)
!516 = !DILocation(line: 106, column: 47, scope: !517, inlinedAt: !488)
!517 = distinct !DILexicalBlock(scope: !458, file: !3, line: 106, column: 9)
!518 = !DILocation(line: 106, column: 73, scope: !517, inlinedAt: !488)
!519 = !DILocation(line: 106, column: 9, scope: !458, inlinedAt: !488)
!520 = !DILocation(line: 109, column: 10, scope: !458, inlinedAt: !488)
!521 = !DILocation(line: 109, column: 18, scope: !458, inlinedAt: !488)
!522 = !DILocation(line: 110, column: 10, scope: !458, inlinedAt: !488)
!523 = !DILocation(line: 110, column: 19, scope: !458, inlinedAt: !488)
!524 = !DILocation(line: 111, column: 10, scope: !458, inlinedAt: !488)
!525 = !DILocation(line: 111, column: 18, scope: !458, inlinedAt: !488)
!526 = !{!527, !350, i64 6}
!527 = !{!"ipv6hdr", !350, i64 0, !350, i64 0, !350, i64 1, !412, i64 4, !350, i64 6, !350, i64 7, !441, i64 8, !441, i64 24}
!528 = !DILocation(line: 112, column: 10, scope: !458, inlinedAt: !488)
!529 = !DILocation(line: 112, column: 20, scope: !458, inlinedAt: !488)
!530 = !{!527, !350, i64 7}
!531 = !DILocation(line: 113, column: 10, scope: !458, inlinedAt: !488)
!532 = !DILocation(line: 113, column: 22, scope: !458, inlinedAt: !488)
!533 = !{!527, !412, i64 4}
!534 = !DILocation(line: 114, column: 28, scope: !458, inlinedAt: !488)
!535 = !DILocation(line: 114, column: 5, scope: !458, inlinedAt: !488)
!536 = !DILocation(line: 116, column: 13, scope: !537, inlinedAt: !488)
!537 = distinct !DILexicalBlock(scope: !458, file: !3, line: 116, column: 9)
!538 = !DILocation(line: 116, column: 33, scope: !537, inlinedAt: !488)
!539 = !DILocation(line: 119, column: 28, scope: !458, inlinedAt: !488)
!540 = !DILocation(line: 119, column: 5, scope: !458, inlinedAt: !488)
!541 = !DILocation(line: 119, column: 36, scope: !458, inlinedAt: !488)
!542 = !DILocation(line: 122, column: 72, scope: !543, inlinedAt: !488)
!543 = distinct !DILexicalBlock(scope: !458, file: !3, line: 122, column: 9)
!544 = !DILocation(line: 122, column: 97, scope: !543, inlinedAt: !488)
!545 = !DILocation(line: 122, column: 9, scope: !458, inlinedAt: !488)
!546 = !DILocation(line: 125, column: 18, scope: !458, inlinedAt: !488)
!547 = !{!548, !350, i64 0}
!548 = !{!"srhhdr", !350, i64 0, !350, i64 1, !350, i64 2, !350, i64 3, !350, i64 4, !350, i64 5, !412, i64 6, !350, i64 8}
!549 = !DILocation(line: 126, column: 32, scope: !458, inlinedAt: !488)
!550 = !DILocation(line: 126, column: 37, scope: !458, inlinedAt: !488)
!551 = !DILocation(line: 126, column: 10, scope: !458, inlinedAt: !488)
!552 = !DILocation(line: 126, column: 20, scope: !458, inlinedAt: !488)
!553 = !{!548, !350, i64 1}
!554 = !DILocation(line: 127, column: 10, scope: !458, inlinedAt: !488)
!555 = !DILocation(line: 127, column: 22, scope: !458, inlinedAt: !488)
!556 = !{!548, !350, i64 2}
!557 = !DILocation(line: 128, column: 29, scope: !458, inlinedAt: !488)
!558 = !DILocation(line: 128, column: 25, scope: !458, inlinedAt: !488)
!559 = !DILocation(line: 128, column: 10, scope: !458, inlinedAt: !488)
!560 = !DILocation(line: 128, column: 23, scope: !458, inlinedAt: !488)
!561 = !{!548, !350, i64 3}
!562 = !DILocation(line: 129, column: 10, scope: !458, inlinedAt: !488)
!563 = !DILocation(line: 129, column: 20, scope: !458, inlinedAt: !488)
!564 = !{!548, !350, i64 4}
!565 = !DILocation(line: 130, column: 10, scope: !458, inlinedAt: !488)
!566 = !DILocation(line: 130, column: 16, scope: !458, inlinedAt: !488)
!567 = !{!548, !350, i64 5}
!568 = !DILocation(line: 131, column: 10, scope: !458, inlinedAt: !488)
!569 = !DILocation(line: 131, column: 14, scope: !458, inlinedAt: !488)
!570 = !{!548, !412, i64 6}
!571 = !DILocation(line: 0, scope: !486, inlinedAt: !488)
!572 = !DILocation(line: 136, column: 15, scope: !573, inlinedAt: !488)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 136, column: 13)
!574 = distinct !DILexicalBlock(scope: !575, file: !3, line: 135, column: 5)
!575 = distinct !DILexicalBlock(scope: !486, file: !3, line: 134, column: 5)
!576 = !DILocation(line: 136, column: 13, scope: !574, inlinedAt: !488)
!577 = !DILocation(line: 139, column: 136, scope: !578, inlinedAt: !488)
!578 = distinct !DILexicalBlock(scope: !574, file: !3, line: 139, column: 13)
!579 = !DILocation(line: 139, column: 141, scope: !578, inlinedAt: !488)
!580 = !DILocation(line: 139, column: 13, scope: !574, inlinedAt: !488)
!581 = !DILocation(line: 142, column: 46, scope: !574, inlinedAt: !488)
!582 = !DILocation(line: 142, column: 9, scope: !574, inlinedAt: !488)
!583 = !DILocation(line: 136, column: 22, scope: !573, inlinedAt: !488)
!584 = !DILocation(line: 142, column: 27, scope: !574, inlinedAt: !488)
!585 = !DILocalVariable(name: "xdp", arg: 1, scope: !586, file: !360, line: 456, type: !61)
!586 = distinct !DISubprogram(name: "rewrite_nexthop", scope: !360, file: !360, line: 456, type: !587, scopeLine: 457, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!60, !61, !65}
!589 = !{!585, !590, !591, !592, !593, !594, !595, !596}
!590 = !DILocalVariable(name: "flag", arg: 2, scope: !586, file: !360, line: 456, type: !65)
!591 = !DILocalVariable(name: "data", scope: !586, file: !360, line: 458, type: !53)
!592 = !DILocalVariable(name: "data_end", scope: !586, file: !360, line: 459, type: !53)
!593 = !DILocalVariable(name: "ifindex", scope: !586, file: !360, line: 467, type: !65)
!594 = !DILocalVariable(name: "smac", scope: !586, file: !360, line: 468, type: !122)
!595 = !DILocalVariable(name: "dmac", scope: !586, file: !360, line: 468, type: !122)
!596 = !DILocalVariable(name: "is_exist", scope: !586, file: !360, line: 470, type: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !6, line: 79, baseType: !598)
!598 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!599 = !DILocation(line: 0, scope: !586, inlinedAt: !600)
!600 = distinct !DILocation(line: 152, column: 16, scope: !601, inlinedAt: !456)
!601 = distinct !DILexicalBlock(scope: !447, file: !3, line: 151, column: 9)
!602 = !DILocation(line: 458, column: 37, scope: !586, inlinedAt: !600)
!603 = !DILocation(line: 458, column: 26, scope: !586, inlinedAt: !600)
!604 = !DILocation(line: 458, column: 18, scope: !586, inlinedAt: !600)
!605 = !DILocation(line: 459, column: 41, scope: !586, inlinedAt: !600)
!606 = !DILocation(line: 459, column: 30, scope: !586, inlinedAt: !600)
!607 = !DILocation(line: 459, column: 22, scope: !586, inlinedAt: !600)
!608 = !DILocation(line: 462, column: 14, scope: !609, inlinedAt: !600)
!609 = distinct !DILexicalBlock(scope: !586, file: !360, line: 462, column: 9)
!610 = !DILocation(line: 462, column: 18, scope: !609, inlinedAt: !600)
!611 = !DILocation(line: 462, column: 9, scope: !586, inlinedAt: !600)
!612 = !DILocation(line: 467, column: 5, scope: !586, inlinedAt: !600)
!613 = !DILocation(line: 468, column: 5, scope: !586, inlinedAt: !600)
!614 = !DILocation(line: 468, column: 10, scope: !586, inlinedAt: !600)
!615 = !DILocation(line: 468, column: 19, scope: !586, inlinedAt: !600)
!616 = !DILocalVariable(name: "xdp", arg: 1, scope: !617, file: !360, line: 344, type: !61)
!617 = distinct !DISubprogram(name: "lookup_nexthop", scope: !360, file: !360, line: 344, type: !618, scopeLine: 345, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !621)
!618 = !DISubroutineType(types: !619)
!619 = !{!597, !61, !53, !53, !620, !65}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!621 = !{!616, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !635, !636, !637, !639}
!622 = !DILocalVariable(name: "smac", arg: 2, scope: !617, file: !360, line: 344, type: !53)
!623 = !DILocalVariable(name: "dmac", arg: 3, scope: !617, file: !360, line: 344, type: !53)
!624 = !DILocalVariable(name: "ifindex", arg: 4, scope: !617, file: !360, line: 344, type: !620)
!625 = !DILocalVariable(name: "flag", arg: 5, scope: !617, file: !360, line: 344, type: !65)
!626 = !DILocalVariable(name: "data", scope: !617, file: !360, line: 346, type: !53)
!627 = !DILocalVariable(name: "data_end", scope: !617, file: !360, line: 347, type: !53)
!628 = !DILocalVariable(name: "eth", scope: !617, file: !360, line: 348, type: !305)
!629 = !DILocalVariable(name: "iph", scope: !617, file: !360, line: 349, type: !313)
!630 = !DILocalVariable(name: "v6h", scope: !617, file: !360, line: 350, type: !328)
!631 = !DILocalVariable(name: "fib_params", scope: !617, file: !360, line: 351, type: !99)
!632 = !DILocalVariable(name: "h_proto", scope: !617, file: !360, line: 352, type: !55)
!633 = !DILocalVariable(name: "src", scope: !634, file: !360, line: 384, type: !71)
!634 = distinct !DILexicalBlock(scope: !617, file: !360, line: 362, column: 5)
!635 = !DILocalVariable(name: "dst", scope: !634, file: !360, line: 385, type: !71)
!636 = !DILocalVariable(name: "rc", scope: !617, file: !360, line: 407, type: !60)
!637 = !DILocalVariable(name: "source", scope: !638, file: !360, line: 419, type: !96)
!638 = distinct !DILexicalBlock(scope: !617, file: !360, line: 410, column: 5)
!639 = !DILocalVariable(name: "dest", scope: !638, file: !360, line: 420, type: !96)
!640 = !DILocation(line: 0, scope: !617, inlinedAt: !641)
!641 = distinct !DILocation(line: 470, column: 21, scope: !586, inlinedAt: !600)
!642 = !DILocation(line: 0, scope: !359, inlinedAt: !643)
!643 = distinct !DILocation(line: 349, column: 25, scope: !617, inlinedAt: !641)
!644 = !DILocation(line: 257, column: 13, scope: !370, inlinedAt: !643)
!645 = !DILocation(line: 257, column: 19, scope: !370, inlinedAt: !643)
!646 = !DILocation(line: 257, column: 17, scope: !370, inlinedAt: !643)
!647 = !DILocation(line: 257, column: 9, scope: !359, inlinedAt: !643)
!648 = !DILocation(line: 0, scope: !375, inlinedAt: !649)
!649 = distinct !DILocation(line: 350, column: 27, scope: !617, inlinedAt: !641)
!650 = !DILocation(line: 245, column: 13, scope: !385, inlinedAt: !649)
!651 = !DILocation(line: 245, column: 19, scope: !385, inlinedAt: !649)
!652 = !DILocation(line: 245, column: 17, scope: !385, inlinedAt: !649)
!653 = !DILocation(line: 245, column: 9, scope: !375, inlinedAt: !649)
!654 = !DILocation(line: 351, column: 5, scope: !617, inlinedAt: !641)
!655 = !DILocation(line: 351, column: 27, scope: !617, inlinedAt: !641)
!656 = !DILocation(line: 355, column: 38, scope: !657, inlinedAt: !641)
!657 = distinct !DILexicalBlock(scope: !617, file: !360, line: 355, column: 9)
!658 = !DILocation(line: 355, column: 9, scope: !617, inlinedAt: !641)
!659 = !DILocation(line: 348, column: 26, scope: !617, inlinedAt: !641)
!660 = !DILocation(line: 358, column: 20, scope: !617, inlinedAt: !641)
!661 = !DILocation(line: 359, column: 5, scope: !617, inlinedAt: !641)
!662 = !DILocation(line: 361, column: 5, scope: !617, inlinedAt: !641)
!663 = !DILocation(line: 364, column: 14, scope: !664, inlinedAt: !641)
!664 = distinct !DILexicalBlock(scope: !634, file: !360, line: 364, column: 13)
!665 = !DILocation(line: 364, column: 13, scope: !634, inlinedAt: !641)
!666 = !DILocation(line: 367, column: 20, scope: !634, inlinedAt: !641)
!667 = !DILocation(line: 367, column: 27, scope: !634, inlinedAt: !641)
!668 = !{!669, !350, i64 0}
!669 = !{!"bpf_fib_lookup", !350, i64 0, !350, i64 1, !412, i64 2, !412, i64 4, !412, i64 6, !349, i64 8, !350, i64 12, !350, i64 16, !350, i64 32, !412, i64 48, !412, i64 50, !350, i64 52, !350, i64 58}
!670 = !DILocation(line: 368, column: 31, scope: !634, inlinedAt: !641)
!671 = !{!429, !350, i64 1}
!672 = !DILocation(line: 368, column: 20, scope: !634, inlinedAt: !641)
!673 = !DILocation(line: 368, column: 24, scope: !634, inlinedAt: !641)
!674 = !{!350, !350, i64 0}
!675 = !DILocation(line: 369, column: 39, scope: !634, inlinedAt: !641)
!676 = !{!429, !350, i64 9}
!677 = !DILocation(line: 369, column: 20, scope: !634, inlinedAt: !641)
!678 = !DILocation(line: 369, column: 32, scope: !634, inlinedAt: !641)
!679 = !{!669, !350, i64 1}
!680 = !DILocation(line: 370, column: 20, scope: !634, inlinedAt: !641)
!681 = !DILocation(line: 370, column: 26, scope: !634, inlinedAt: !641)
!682 = !{!669, !412, i64 2}
!683 = !DILocation(line: 371, column: 20, scope: !634, inlinedAt: !641)
!684 = !DILocation(line: 371, column: 26, scope: !634, inlinedAt: !641)
!685 = !{!669, !412, i64 4}
!686 = !DILocation(line: 372, column: 30, scope: !634, inlinedAt: !641)
!687 = !DILocation(line: 372, column: 20, scope: !634, inlinedAt: !641)
!688 = !DILocation(line: 372, column: 28, scope: !634, inlinedAt: !641)
!689 = !{!669, !412, i64 6}
!690 = !DILocation(line: 373, column: 36, scope: !634, inlinedAt: !641)
!691 = !{!429, !349, i64 12}
!692 = !DILocation(line: 373, column: 20, scope: !634, inlinedAt: !641)
!693 = !DILocation(line: 373, column: 29, scope: !634, inlinedAt: !641)
!694 = !DILocation(line: 374, column: 36, scope: !634, inlinedAt: !641)
!695 = !DILocation(line: 374, column: 20, scope: !634, inlinedAt: !641)
!696 = !DILocation(line: 374, column: 29, scope: !634, inlinedAt: !641)
!697 = !DILocation(line: 375, column: 9, scope: !634, inlinedAt: !641)
!698 = !DILocation(line: 378, column: 14, scope: !699, inlinedAt: !641)
!699 = distinct !DILexicalBlock(scope: !634, file: !360, line: 378, column: 13)
!700 = !DILocation(line: 378, column: 13, scope: !634, inlinedAt: !641)
!701 = !DILocation(line: 381, column: 18, scope: !702, inlinedAt: !641)
!702 = distinct !DILexicalBlock(scope: !634, file: !360, line: 381, column: 13)
!703 = !DILocation(line: 381, column: 28, scope: !702, inlinedAt: !641)
!704 = !DILocation(line: 381, column: 13, scope: !634, inlinedAt: !641)
!705 = !DILocation(line: 384, column: 62, scope: !634, inlinedAt: !641)
!706 = !DILocation(line: 0, scope: !634, inlinedAt: !641)
!707 = !DILocation(line: 385, column: 62, scope: !634, inlinedAt: !641)
!708 = !DILocation(line: 387, column: 20, scope: !634, inlinedAt: !641)
!709 = !DILocation(line: 387, column: 27, scope: !634, inlinedAt: !641)
!710 = !DILocation(line: 388, column: 20, scope: !634, inlinedAt: !641)
!711 = !DILocation(line: 388, column: 24, scope: !634, inlinedAt: !641)
!712 = !DILocation(line: 389, column: 31, scope: !634, inlinedAt: !641)
!713 = !{!349, !349, i64 0}
!714 = !DILocation(line: 389, column: 46, scope: !634, inlinedAt: !641)
!715 = !DILocation(line: 389, column: 20, scope: !634, inlinedAt: !641)
!716 = !DILocation(line: 389, column: 29, scope: !634, inlinedAt: !641)
!717 = !DILocation(line: 390, column: 39, scope: !634, inlinedAt: !641)
!718 = !DILocation(line: 390, column: 20, scope: !634, inlinedAt: !641)
!719 = !DILocation(line: 390, column: 32, scope: !634, inlinedAt: !641)
!720 = !DILocation(line: 391, column: 20, scope: !634, inlinedAt: !641)
!721 = !DILocation(line: 391, column: 26, scope: !634, inlinedAt: !641)
!722 = !DILocation(line: 392, column: 20, scope: !634, inlinedAt: !641)
!723 = !DILocation(line: 392, column: 26, scope: !634, inlinedAt: !641)
!724 = !DILocation(line: 393, column: 30, scope: !634, inlinedAt: !641)
!725 = !DILocation(line: 393, column: 20, scope: !634, inlinedAt: !641)
!726 = !DILocation(line: 393, column: 28, scope: !634, inlinedAt: !641)
!727 = !DILocation(line: 394, column: 21, scope: !634, inlinedAt: !641)
!728 = !{i64 0, i64 16, !674, i64 0, i64 16, !674, i64 0, i64 16, !674}
!729 = !DILocation(line: 395, column: 21, scope: !634, inlinedAt: !641)
!730 = !DILocation(line: 396, column: 9, scope: !634, inlinedAt: !641)
!731 = !DILocation(line: 405, column: 31, scope: !617, inlinedAt: !641)
!732 = !{!348, !349, i64 12}
!733 = !DILocation(line: 405, column: 16, scope: !617, inlinedAt: !641)
!734 = !DILocation(line: 405, column: 24, scope: !617, inlinedAt: !641)
!735 = !{!669, !349, i64 8}
!736 = !DILocation(line: 407, column: 29, scope: !617, inlinedAt: !641)
!737 = !DILocation(line: 407, column: 14, scope: !617, inlinedAt: !641)
!738 = !DILocation(line: 409, column: 5, scope: !617, inlinedAt: !641)
!739 = !DILocation(line: 412, column: 13, scope: !638, inlinedAt: !641)
!740 = !DILocalVariable(name: "iph", arg: 1, scope: !741, file: !360, line: 154, type: !313)
!741 = distinct !DISubprogram(name: "ip_decrease_ttl", scope: !360, file: !360, line: 154, type: !742, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{!60, !313}
!744 = !{!740, !745}
!745 = !DILocalVariable(name: "check", scope: !741, file: !360, line: 156, type: !65)
!746 = !DILocation(line: 0, scope: !741, inlinedAt: !747)
!747 = distinct !DILocation(line: 413, column: 13, scope: !748, inlinedAt: !641)
!748 = distinct !DILexicalBlock(scope: !638, file: !360, line: 412, column: 13)
!749 = !DILocation(line: 156, column: 31, scope: !741, inlinedAt: !747)
!750 = !{!429, !412, i64 10}
!751 = !DILocation(line: 158, column: 11, scope: !741, inlinedAt: !747)
!752 = !DILocation(line: 159, column: 43, scope: !741, inlinedAt: !747)
!753 = !DILocation(line: 159, column: 34, scope: !741, inlinedAt: !747)
!754 = !DILocation(line: 159, column: 16, scope: !741, inlinedAt: !747)
!755 = !DILocation(line: 160, column: 19, scope: !741, inlinedAt: !747)
!756 = !DILocation(line: 160, column: 12, scope: !741, inlinedAt: !747)
!757 = !{!429, !350, i64 8}
!758 = !DILocation(line: 413, column: 13, scope: !748, inlinedAt: !641)
!759 = !DILocation(line: 415, column: 18, scope: !760, inlinedAt: !641)
!760 = distinct !DILexicalBlock(scope: !748, file: !360, line: 414, column: 18)
!761 = !DILocation(line: 415, column: 27, scope: !760, inlinedAt: !641)
!762 = !DILocation(line: 415, column: 13, scope: !760, inlinedAt: !641)
!763 = !DILocation(line: 454, column: 1, scope: !617, inlinedAt: !641)
!764 = !DILocation(line: 471, column: 9, scope: !586, inlinedAt: !600)
!765 = !DILocation(line: 417, column: 31, scope: !638, inlinedAt: !641)
!766 = !DILocation(line: 417, column: 18, scope: !638, inlinedAt: !641)
!767 = !DILocation(line: 0, scope: !638, inlinedAt: !641)
!768 = !DILocation(line: 421, column: 43, scope: !638, inlinedAt: !641)
!769 = !DILocation(line: 421, column: 9, scope: !638, inlinedAt: !641)
!770 = !DILocation(line: 422, column: 45, scope: !638, inlinedAt: !641)
!771 = !DILocation(line: 422, column: 9, scope: !638, inlinedAt: !641)
!772 = !DILocalVariable(name: "data", arg: 1, scope: !773, file: !360, line: 217, type: !53)
!773 = distinct !DISubprogram(name: "set_src_dst_mac", scope: !360, file: !360, line: 217, type: !774, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !53, !53, !53}
!776 = !{!772, !777, !778, !779, !781, !782}
!777 = !DILocalVariable(name: "src", arg: 2, scope: !773, file: !360, line: 217, type: !53)
!778 = !DILocalVariable(name: "dst", arg: 3, scope: !773, file: !360, line: 217, type: !53)
!779 = !DILocalVariable(name: "source", scope: !773, file: !360, line: 219, type: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!781 = !DILocalVariable(name: "dest", scope: !773, file: !360, line: 220, type: !780)
!782 = !DILocalVariable(name: "p", scope: !773, file: !360, line: 221, type: !780)
!783 = !DILocation(line: 0, scope: !773, inlinedAt: !784)
!784 = distinct !DILocation(line: 473, column: 9, scope: !785, inlinedAt: !600)
!785 = distinct !DILexicalBlock(scope: !786, file: !360, line: 472, column: 5)
!786 = distinct !DILexicalBlock(scope: !586, file: !360, line: 471, column: 9)
!787 = !DILocation(line: 223, column: 5, scope: !773, inlinedAt: !784)
!788 = !DILocation(line: 224, column: 24, scope: !773, inlinedAt: !784)
!789 = !DILocation(line: 224, column: 5, scope: !773, inlinedAt: !784)
!790 = !DILocation(line: 475, column: 14, scope: !791, inlinedAt: !600)
!791 = distinct !DILexicalBlock(scope: !785, file: !360, line: 475, column: 13)
!792 = !DILocation(line: 475, column: 13, scope: !785, inlinedAt: !600)
!793 = !DILocation(line: 478, column: 18, scope: !794, inlinedAt: !600)
!794 = distinct !DILexicalBlock(scope: !785, file: !360, line: 478, column: 13)
!795 = !DILocation(line: 478, column: 37, scope: !794, inlinedAt: !600)
!796 = !DILocation(line: 478, column: 34, scope: !794, inlinedAt: !600)
!797 = !DILocation(line: 478, column: 13, scope: !785, inlinedAt: !600)
!798 = !DILocation(line: 484, column: 16, scope: !785, inlinedAt: !600)
!799 = !DILocation(line: 484, column: 9, scope: !785, inlinedAt: !600)
!800 = !DILocation(line: 488, column: 1, scope: !586, inlinedAt: !600)
!801 = !DILocation(line: 0, scope: !397, inlinedAt: !802)
!802 = distinct !DILocation(line: 428, column: 24, scope: !444)
!803 = !DILocation(line: 32, column: 2, scope: !397, inlinedAt: !802)
!804 = !DILocation(line: 428, column: 17, scope: !444)
!805 = !DILocalVariable(name: "xdp", arg: 1, scope: !806, file: !3, line: 156, type: !61)
!806 = distinct !DISubprogram(name: "transit_gtp4_encap", scope: !3, file: !3, line: 156, type: !807, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!60, !61, !213}
!809 = !{!805, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !832, !833, !834, !849, !850, !851, !852, !853, !854, !855, !856}
!810 = !DILocalVariable(name: "tb", arg: 2, scope: !806, file: !3, line: 156, type: !213)
!811 = !DILocalVariable(name: "data", scope: !806, file: !3, line: 159, type: !53)
!812 = !DILocalVariable(name: "data_end", scope: !806, file: !3, line: 160, type: !53)
!813 = !DILocalVariable(name: "iph", scope: !806, file: !3, line: 161, type: !313)
!814 = !DILocalVariable(name: "type", scope: !806, file: !3, line: 162, type: !79)
!815 = !DILocalVariable(name: "tid", scope: !806, file: !3, line: 163, type: !65)
!816 = !DILocalVariable(name: "v6h", scope: !806, file: !3, line: 165, type: !328)
!817 = !DILocalVariable(name: "srh", scope: !806, file: !3, line: 166, type: !469)
!818 = !DILocalVariable(name: "srh_len", scope: !806, file: !3, line: 167, type: !79)
!819 = !DILocalVariable(name: "decap_len", scope: !806, file: !3, line: 168, type: !55)
!820 = !DILocalVariable(name: "encap_len", scope: !806, file: !3, line: 168, type: !55)
!821 = !DILocalVariable(name: "innerlen", scope: !806, file: !3, line: 169, type: !55)
!822 = !DILocalVariable(name: "outer_saddr", scope: !806, file: !3, line: 170, type: !65)
!823 = !DILocalVariable(name: "outer_daddr", scope: !806, file: !3, line: 170, type: !65)
!824 = !DILocalVariable(name: "gtp1h", scope: !806, file: !3, line: 178, type: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gtp1hdr", file: !166, line: 75, size: 64, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !166, line: 83, baseType: !79, size: 8)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !826, file: !166, line: 84, baseType: !79, size: 8, offset: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !826, file: !166, line: 85, baseType: !55, size: 16, offset: 16)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !826, file: !166, line: 86, baseType: !65, size: 32, offset: 32)
!832 = !DILocalVariable(name: "seg_len", scope: !806, file: !3, line: 207, type: !65)
!833 = !DILocalVariable(name: "new_eth", scope: !806, file: !3, line: 222, type: !305)
!834 = !DILocalVariable(name: "args", scope: !806, file: !3, line: 243, type: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "args_mob_session", file: !166, line: 96, size: 40, elements: !836)
!836 = !{!837, !838, !839, !840}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "qfi", scope: !835, file: !166, line: 98, baseType: !79, size: 6, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !835, file: !166, line: 99, baseType: !79, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !835, file: !166, line: 100, baseType: !79, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !835, file: !166, line: 110, baseType: !841, size: 32, offset: 8)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !835, file: !166, line: 102, size: 32, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pdu_session_id", scope: !841, file: !166, line: 104, baseType: !65, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !841, file: !166, line: 109, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq", file: !166, line: 105, size: 32, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !845, file: !166, line: 107, baseType: !55, size: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !845, file: !166, line: 108, baseType: !55, size: 16, offset: 16)
!849 = !DILocalVariable(name: "s_offset", scope: !806, file: !3, line: 244, type: !55)
!850 = !DILocalVariable(name: "s_shift", scope: !806, file: !3, line: 244, type: !55)
!851 = !DILocalVariable(name: "d_offset", scope: !806, file: !3, line: 244, type: !55)
!852 = !DILocalVariable(name: "d_shift", scope: !806, file: !3, line: 244, type: !55)
!853 = !DILocalVariable(name: "src_p", scope: !806, file: !3, line: 258, type: !96)
!854 = !DILocalVariable(name: "dst_p", scope: !806, file: !3, line: 258, type: !96)
!855 = !DILocalVariable(name: "args_p", scope: !806, file: !3, line: 258, type: !96)
!856 = !DILocalVariable(name: "i", scope: !857, file: !3, line: 286, type: !55)
!857 = distinct !DILexicalBlock(scope: !806, file: !3, line: 286, column: 5)
!858 = !DILocation(line: 0, scope: !806, inlinedAt: !859)
!859 = distinct !DILocation(line: 431, column: 55, scope: !444)
!860 = !DILocation(line: 159, column: 46, scope: !806, inlinedAt: !859)
!861 = !DILocation(line: 159, column: 26, scope: !806, inlinedAt: !859)
!862 = !DILocation(line: 159, column: 18, scope: !806, inlinedAt: !859)
!863 = !DILocation(line: 160, column: 50, scope: !806, inlinedAt: !859)
!864 = !DILocation(line: 0, scope: !359, inlinedAt: !865)
!865 = distinct !DILocation(line: 161, column: 25, scope: !806, inlinedAt: !859)
!866 = !DILocation(line: 254, column: 30, scope: !359, inlinedAt: !865)
!867 = !DILocation(line: 257, column: 13, scope: !370, inlinedAt: !865)
!868 = !DILocation(line: 257, column: 19, scope: !370, inlinedAt: !865)
!869 = !DILocation(line: 257, column: 17, scope: !370, inlinedAt: !865)
!870 = !DILocation(line: 257, column: 9, scope: !359, inlinedAt: !865)
!871 = !DILocation(line: 170, column: 5, scope: !806, inlinedAt: !859)
!872 = !DILocation(line: 171, column: 10, scope: !873, inlinedAt: !859)
!873 = distinct !DILexicalBlock(scope: !806, file: !3, line: 171, column: 9)
!874 = !DILocation(line: 171, column: 9, scope: !806, inlinedAt: !859)
!875 = !DILocation(line: 160, column: 22, scope: !806, inlinedAt: !859)
!876 = !DILocation(line: 175, column: 14, scope: !877, inlinedAt: !859)
!877 = distinct !DILexicalBlock(scope: !806, file: !3, line: 175, column: 9)
!878 = !DILocation(line: 175, column: 23, scope: !877, inlinedAt: !859)
!879 = !DILocation(line: 175, column: 9, scope: !806, inlinedAt: !859)
!880 = !DILocation(line: 182, column: 43, scope: !806, inlinedAt: !859)
!881 = !DILocation(line: 182, column: 5, scope: !806, inlinedAt: !859)
!882 = !DILocation(line: 183, column: 43, scope: !806, inlinedAt: !859)
!883 = !DILocation(line: 183, column: 5, scope: !806, inlinedAt: !859)
!884 = !DILocation(line: 188, column: 18, scope: !806, inlinedAt: !859)
!885 = !{!886, !349, i64 4}
!886 = !{!"gtp1hdr", !350, i64 0, !350, i64 1, !412, i64 2, !349, i64 4}
!887 = !DILocation(line: 189, column: 19, scope: !806, inlinedAt: !859)
!888 = !{!886, !350, i64 1}
!889 = !DILocation(line: 190, column: 16, scope: !806, inlinedAt: !859)
!890 = !{!886, !412, i64 2}
!891 = !DILocation(line: 192, column: 14, scope: !892, inlinedAt: !859)
!892 = distinct !DILexicalBlock(scope: !806, file: !3, line: 192, column: 9)
!893 = !DILocation(line: 192, column: 9, scope: !806, inlinedAt: !859)
!894 = !DILocation(line: 195, column: 13, scope: !895, inlinedAt: !859)
!895 = distinct !DILexicalBlock(scope: !806, file: !3, line: 195, column: 9)
!896 = !{!440, !349, i64 32}
!897 = !DILocation(line: 195, column: 25, scope: !895, inlinedAt: !859)
!898 = !DILocation(line: 195, column: 30, scope: !895, inlinedAt: !859)
!899 = !DILocation(line: 195, column: 37, scope: !895, inlinedAt: !859)
!900 = !{!440, !349, i64 36}
!901 = !DILocation(line: 195, column: 54, scope: !895, inlinedAt: !859)
!902 = !DILocation(line: 207, column: 25, scope: !806, inlinedAt: !859)
!903 = !DILocation(line: 207, column: 40, scope: !806, inlinedAt: !859)
!904 = !DILocation(line: 208, column: 66, scope: !806, inlinedAt: !859)
!905 = !DILocation(line: 208, column: 64, scope: !806, inlinedAt: !859)
!906 = !DILocation(line: 208, column: 37, scope: !806, inlinedAt: !859)
!907 = !DILocation(line: 211, column: 23, scope: !806, inlinedAt: !859)
!908 = !DILocation(line: 213, column: 9, scope: !909, inlinedAt: !859)
!909 = distinct !DILexicalBlock(scope: !806, file: !3, line: 213, column: 9)
!910 = !DILocation(line: 213, column: 9, scope: !806, inlinedAt: !859)
!911 = !DILocation(line: 210, column: 42, scope: !806, inlinedAt: !859)
!912 = !DILocation(line: 210, column: 40, scope: !806, inlinedAt: !859)
!913 = !DILocation(line: 216, column: 36, scope: !914, inlinedAt: !859)
!914 = distinct !DILexicalBlock(scope: !806, file: !3, line: 216, column: 9)
!915 = !DILocation(line: 216, column: 9, scope: !914, inlinedAt: !859)
!916 = !DILocation(line: 216, column: 9, scope: !806, inlinedAt: !859)
!917 = !DILocation(line: 219, column: 31, scope: !806, inlinedAt: !859)
!918 = !DILocation(line: 219, column: 20, scope: !806, inlinedAt: !859)
!919 = !DILocation(line: 220, column: 35, scope: !806, inlinedAt: !859)
!920 = !DILocation(line: 220, column: 24, scope: !806, inlinedAt: !859)
!921 = !DILocation(line: 220, column: 16, scope: !806, inlinedAt: !859)
!922 = !DILocation(line: 223, column: 32, scope: !923, inlinedAt: !859)
!923 = distinct !DILexicalBlock(scope: !806, file: !3, line: 223, column: 9)
!924 = !DILocation(line: 223, column: 9, scope: !923, inlinedAt: !859)
!925 = !DILocation(line: 223, column: 57, scope: !923, inlinedAt: !859)
!926 = !DILocation(line: 223, column: 9, scope: !806, inlinedAt: !859)
!927 = !DILocation(line: 222, column: 30, scope: !806, inlinedAt: !859)
!928 = !DILocation(line: 219, column: 12, scope: !806, inlinedAt: !859)
!929 = !DILocation(line: 226, column: 14, scope: !806, inlinedAt: !859)
!930 = !DILocation(line: 226, column: 22, scope: !806, inlinedAt: !859)
!931 = !DILocation(line: 228, column: 24, scope: !806, inlinedAt: !859)
!932 = !DILocation(line: 228, column: 11, scope: !806, inlinedAt: !859)
!933 = !DILocation(line: 229, column: 47, scope: !934, inlinedAt: !859)
!934 = distinct !DILexicalBlock(scope: !806, file: !3, line: 229, column: 9)
!935 = !DILocation(line: 229, column: 73, scope: !934, inlinedAt: !859)
!936 = !DILocation(line: 229, column: 9, scope: !806, inlinedAt: !859)
!937 = !DILocation(line: 232, column: 10, scope: !806, inlinedAt: !859)
!938 = !DILocation(line: 232, column: 18, scope: !806, inlinedAt: !859)
!939 = !DILocation(line: 233, column: 10, scope: !806, inlinedAt: !859)
!940 = !DILocation(line: 233, column: 19, scope: !806, inlinedAt: !859)
!941 = !DILocation(line: 234, column: 10, scope: !806, inlinedAt: !859)
!942 = !DILocation(line: 234, column: 18, scope: !806, inlinedAt: !859)
!943 = !DILocation(line: 235, column: 10, scope: !806, inlinedAt: !859)
!944 = !DILocation(line: 235, column: 20, scope: !806, inlinedAt: !859)
!945 = !DILocation(line: 236, column: 10, scope: !806, inlinedAt: !859)
!946 = !DILocation(line: 236, column: 22, scope: !806, inlinedAt: !859)
!947 = !DILocation(line: 237, column: 28, scope: !806, inlinedAt: !859)
!948 = !DILocation(line: 237, column: 5, scope: !806, inlinedAt: !859)
!949 = !DILocation(line: 238, column: 21, scope: !950, inlinedAt: !859)
!950 = distinct !DILexicalBlock(scope: !806, file: !3, line: 238, column: 9)
!951 = !DILocation(line: 241, column: 28, scope: !806, inlinedAt: !859)
!952 = !DILocation(line: 241, column: 5, scope: !806, inlinedAt: !859)
!953 = !DILocation(line: 241, column: 40, scope: !806, inlinedAt: !859)
!954 = !DILocation(line: 241, column: 36, scope: !806, inlinedAt: !859)
!955 = !DILocation(line: 243, column: 5, scope: !806, inlinedAt: !859)
!956 = !DILocation(line: 243, column: 29, scope: !806, inlinedAt: !859)
!957 = !DILocation(line: 246, column: 20, scope: !806, inlinedAt: !859)
!958 = !DILocation(line: 246, column: 32, scope: !806, inlinedAt: !859)
!959 = !DILocation(line: 246, column: 16, scope: !806, inlinedAt: !859)
!960 = !DILocation(line: 247, column: 15, scope: !806, inlinedAt: !859)
!961 = !DILocation(line: 248, column: 20, scope: !806, inlinedAt: !859)
!962 = !DILocation(line: 248, column: 32, scope: !806, inlinedAt: !859)
!963 = !DILocation(line: 248, column: 16, scope: !806, inlinedAt: !859)
!964 = !DILocation(line: 249, column: 15, scope: !806, inlinedAt: !859)
!965 = !DILocation(line: 253, column: 12, scope: !806, inlinedAt: !859)
!966 = !DILocation(line: 255, column: 18, scope: !806, inlinedAt: !859)
!967 = !DILocation(line: 255, column: 33, scope: !806, inlinedAt: !859)
!968 = !DILocalVariable(name: "v6addr", arg: 1, scope: !969, file: !360, line: 114, type: !71)
!969 = distinct !DISubprogram(name: "write_v6addr_in_pyload", scope: !360, file: !360, line: 113, type: !970, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !974)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !71, !96, !55, !55, !55, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!974 = !{!968, !975, !976, !977, !978, !979, !980, !984, !987}
!975 = !DILocalVariable(name: "payload", arg: 2, scope: !969, file: !360, line: 114, type: !96)
!976 = !DILocalVariable(name: "payload_size", arg: 3, scope: !969, file: !360, line: 114, type: !55)
!977 = !DILocalVariable(name: "offset", arg: 4, scope: !969, file: !360, line: 114, type: !55)
!978 = !DILocalVariable(name: "shift", arg: 5, scope: !969, file: !360, line: 114, type: !55)
!979 = !DILocalVariable(name: "data_end", arg: 6, scope: !969, file: !360, line: 114, type: !972)
!980 = !DILocalVariable(name: "index", scope: !981, file: !360, line: 133, type: !55)
!981 = distinct !DILexicalBlock(scope: !982, file: !360, line: 133, column: 9)
!982 = distinct !DILexicalBlock(scope: !983, file: !360, line: 131, column: 5)
!983 = distinct !DILexicalBlock(scope: !969, file: !360, line: 123, column: 9)
!984 = !DILocalVariable(name: "v6val1", scope: !985, file: !360, line: 140, type: !96)
!985 = distinct !DILexicalBlock(scope: !986, file: !360, line: 134, column: 9)
!986 = distinct !DILexicalBlock(scope: !981, file: !360, line: 133, column: 9)
!987 = !DILocalVariable(name: "v6val2", scope: !985, file: !360, line: 141, type: !96)
!988 = !DILocation(line: 0, scope: !969, inlinedAt: !989)
!989 = distinct !DILocation(line: 263, column: 5, scope: !806, inlinedAt: !859)
!990 = !DILocation(line: 116, column: 21, scope: !969, inlinedAt: !989)
!991 = !DILocation(line: 118, column: 36, scope: !992, inlinedAt: !989)
!992 = distinct !DILexicalBlock(scope: !969, file: !360, line: 118, column: 9)
!993 = !DILocation(line: 118, column: 43, scope: !992, inlinedAt: !989)
!994 = !DILocation(line: 123, column: 9, scope: !983, inlinedAt: !989)
!995 = !DILocation(line: 123, column: 15, scope: !983, inlinedAt: !989)
!996 = !DILocation(line: 0, scope: !983, inlinedAt: !989)
!997 = !DILocation(line: 123, column: 9, scope: !969, inlinedAt: !989)
!998 = !DILocation(line: 0, scope: !981, inlinedAt: !989)
!999 = !DILocation(line: 0, scope: !1000, inlinedAt: !989)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !360, line: 143, column: 13)
!1001 = distinct !DILexicalBlock(scope: !985, file: !360, line: 142, column: 17)
!1002 = !DILocation(line: 133, column: 9, scope: !981, inlinedAt: !989)
!1003 = !DILocation(line: 125, column: 37, scope: !1004, inlinedAt: !989)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !360, line: 125, column: 13)
!1005 = distinct !DILexicalBlock(scope: !983, file: !360, line: 124, column: 5)
!1006 = !DILocation(line: 125, column: 52, scope: !1004, inlinedAt: !989)
!1007 = !DILocation(line: 125, column: 13, scope: !1005, inlinedAt: !989)
!1008 = !DILocation(line: 128, column: 35, scope: !1005, inlinedAt: !989)
!1009 = !DILocation(line: 128, column: 41, scope: !1005, inlinedAt: !989)
!1010 = !DILocation(line: 128, column: 27, scope: !1005, inlinedAt: !989)
!1011 = !DILocation(line: 128, column: 9, scope: !1005, inlinedAt: !989)
!1012 = !DILocation(line: 129, column: 5, scope: !1005, inlinedAt: !989)
!1013 = !DILocation(line: 140, column: 60, scope: !985, inlinedAt: !989)
!1014 = !DILocation(line: 0, scope: !985, inlinedAt: !989)
!1015 = !DILocation(line: 141, column: 68, scope: !985, inlinedAt: !989)
!1016 = !DILocation(line: 142, column: 28, scope: !1001, inlinedAt: !989)
!1017 = !DILocation(line: 142, column: 40, scope: !1001, inlinedAt: !989)
!1018 = !DILocation(line: 144, column: 28, scope: !1000, inlinedAt: !989)
!1019 = !DILocation(line: 144, column: 43, scope: !1000, inlinedAt: !989)
!1020 = !DILocation(line: 144, column: 25, scope: !1000, inlinedAt: !989)
!1021 = !DILocation(line: 145, column: 43, scope: !1000, inlinedAt: !989)
!1022 = !DILocation(line: 145, column: 25, scope: !1000, inlinedAt: !989)
!1023 = !DILocation(line: 133, column: 69, scope: !986, inlinedAt: !989)
!1024 = distinct !{!1024, !1002, !1025, !1026}
!1025 = !DILocation(line: 149, column: 9, scope: !981, inlinedAt: !989)
!1026 = !{!"llvm.loop.unroll.disable"}
!1027 = !DILocation(line: 266, column: 72, scope: !1028, inlinedAt: !859)
!1028 = distinct !DILexicalBlock(scope: !806, file: !3, line: 266, column: 9)
!1029 = !DILocation(line: 266, column: 97, scope: !1028, inlinedAt: !859)
!1030 = !DILocation(line: 266, column: 9, scope: !806, inlinedAt: !859)
!1031 = !DILocation(line: 269, column: 18, scope: !806, inlinedAt: !859)
!1032 = !DILocation(line: 270, column: 32, scope: !806, inlinedAt: !859)
!1033 = !DILocation(line: 270, column: 37, scope: !806, inlinedAt: !859)
!1034 = !DILocation(line: 270, column: 10, scope: !806, inlinedAt: !859)
!1035 = !DILocation(line: 270, column: 20, scope: !806, inlinedAt: !859)
!1036 = !DILocation(line: 271, column: 10, scope: !806, inlinedAt: !859)
!1037 = !DILocation(line: 271, column: 22, scope: !806, inlinedAt: !859)
!1038 = !DILocation(line: 272, column: 25, scope: !806, inlinedAt: !859)
!1039 = !DILocation(line: 272, column: 10, scope: !806, inlinedAt: !859)
!1040 = !DILocation(line: 272, column: 23, scope: !806, inlinedAt: !859)
!1041 = !DILocation(line: 273, column: 10, scope: !806, inlinedAt: !859)
!1042 = !DILocation(line: 273, column: 20, scope: !806, inlinedAt: !859)
!1043 = !DILocation(line: 274, column: 10, scope: !806, inlinedAt: !859)
!1044 = !DILocation(line: 274, column: 16, scope: !806, inlinedAt: !859)
!1045 = !DILocation(line: 275, column: 10, scope: !806, inlinedAt: !859)
!1046 = !DILocation(line: 275, column: 14, scope: !806, inlinedAt: !859)
!1047 = !DILocation(line: 276, column: 122, scope: !1048, inlinedAt: !859)
!1048 = distinct !DILexicalBlock(scope: !806, file: !3, line: 276, column: 9)
!1049 = !DILocation(line: 276, column: 127, scope: !1048, inlinedAt: !859)
!1050 = !DILocation(line: 276, column: 9, scope: !806, inlinedAt: !859)
!1051 = !DILocation(line: 279, column: 5, scope: !806, inlinedAt: !859)
!1052 = !DILocation(line: 280, column: 28, scope: !806, inlinedAt: !859)
!1053 = !DILocation(line: 280, column: 23, scope: !806, inlinedAt: !859)
!1054 = !DILocation(line: 280, column: 46, scope: !806, inlinedAt: !859)
!1055 = !DILocation(line: 280, column: 5, scope: !806, inlinedAt: !859)
!1056 = !DILocation(line: 0, scope: !969, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 281, column: 5, scope: !806, inlinedAt: !859)
!1058 = !DILocation(line: 116, column: 21, scope: !969, inlinedAt: !1057)
!1059 = !DILocation(line: 118, column: 36, scope: !992, inlinedAt: !1057)
!1060 = !DILocation(line: 118, column: 43, scope: !992, inlinedAt: !1057)
!1061 = !DILocation(line: 123, column: 15, scope: !983, inlinedAt: !1057)
!1062 = !DILocation(line: 0, scope: !983, inlinedAt: !1057)
!1063 = !DILocation(line: 123, column: 9, scope: !969, inlinedAt: !1057)
!1064 = !DILocation(line: 0, scope: !981, inlinedAt: !1057)
!1065 = !DILocation(line: 0, scope: !1000, inlinedAt: !1057)
!1066 = !DILocation(line: 133, column: 9, scope: !981, inlinedAt: !1057)
!1067 = !DILocation(line: 125, column: 37, scope: !1004, inlinedAt: !1057)
!1068 = !DILocation(line: 125, column: 52, scope: !1004, inlinedAt: !1057)
!1069 = !DILocation(line: 125, column: 13, scope: !1005, inlinedAt: !1057)
!1070 = !DILocation(line: 128, column: 35, scope: !1005, inlinedAt: !1057)
!1071 = !DILocation(line: 128, column: 41, scope: !1005, inlinedAt: !1057)
!1072 = !DILocation(line: 128, column: 27, scope: !1005, inlinedAt: !1057)
!1073 = !DILocation(line: 128, column: 9, scope: !1005, inlinedAt: !1057)
!1074 = !DILocation(line: 129, column: 5, scope: !1005, inlinedAt: !1057)
!1075 = !DILocation(line: 140, column: 60, scope: !985, inlinedAt: !1057)
!1076 = !DILocation(line: 0, scope: !985, inlinedAt: !1057)
!1077 = !DILocation(line: 141, column: 68, scope: !985, inlinedAt: !1057)
!1078 = !DILocation(line: 142, column: 28, scope: !1001, inlinedAt: !1057)
!1079 = !DILocation(line: 142, column: 40, scope: !1001, inlinedAt: !1057)
!1080 = !DILocation(line: 144, column: 28, scope: !1000, inlinedAt: !1057)
!1081 = !DILocation(line: 144, column: 43, scope: !1000, inlinedAt: !1057)
!1082 = !DILocation(line: 144, column: 25, scope: !1000, inlinedAt: !1057)
!1083 = !DILocation(line: 145, column: 28, scope: !1000, inlinedAt: !1057)
!1084 = !DILocation(line: 145, column: 43, scope: !1000, inlinedAt: !1057)
!1085 = !DILocation(line: 145, column: 25, scope: !1000, inlinedAt: !1057)
!1086 = !DILocation(line: 133, column: 69, scope: !986, inlinedAt: !1057)
!1087 = distinct !{!1087, !1066, !1088, !1026}
!1088 = !DILocation(line: 149, column: 9, scope: !981, inlinedAt: !1057)
!1089 = !DILocation(line: 282, column: 14, scope: !806, inlinedAt: !859)
!1090 = !DILocation(line: 0, scope: !969, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 283, column: 5, scope: !806, inlinedAt: !859)
!1092 = !DILocation(line: 116, column: 21, scope: !969, inlinedAt: !1091)
!1093 = !DILocation(line: 118, column: 36, scope: !992, inlinedAt: !1091)
!1094 = !DILocation(line: 118, column: 43, scope: !992, inlinedAt: !1091)
!1095 = !DILocation(line: 123, column: 15, scope: !983, inlinedAt: !1091)
!1096 = !DILocation(line: 0, scope: !983, inlinedAt: !1091)
!1097 = !DILocation(line: 123, column: 9, scope: !969, inlinedAt: !1091)
!1098 = !DILocation(line: 0, scope: !981, inlinedAt: !1091)
!1099 = !DILocation(line: 0, scope: !1000, inlinedAt: !1091)
!1100 = !DILocation(line: 133, column: 9, scope: !981, inlinedAt: !1091)
!1101 = !DILocation(line: 125, column: 37, scope: !1004, inlinedAt: !1091)
!1102 = !DILocation(line: 125, column: 52, scope: !1004, inlinedAt: !1091)
!1103 = !DILocation(line: 125, column: 13, scope: !1005, inlinedAt: !1091)
!1104 = !DILocation(line: 128, column: 35, scope: !1005, inlinedAt: !1091)
!1105 = !DILocation(line: 128, column: 41, scope: !1005, inlinedAt: !1091)
!1106 = !DILocation(line: 128, column: 27, scope: !1005, inlinedAt: !1091)
!1107 = !DILocation(line: 128, column: 9, scope: !1005, inlinedAt: !1091)
!1108 = !DILocation(line: 129, column: 5, scope: !1005, inlinedAt: !1091)
!1109 = !DILocation(line: 140, column: 60, scope: !985, inlinedAt: !1091)
!1110 = !DILocation(line: 0, scope: !985, inlinedAt: !1091)
!1111 = !DILocation(line: 141, column: 68, scope: !985, inlinedAt: !1091)
!1112 = !DILocation(line: 142, column: 28, scope: !1001, inlinedAt: !1091)
!1113 = !DILocation(line: 142, column: 40, scope: !1001, inlinedAt: !1091)
!1114 = !DILocation(line: 144, column: 28, scope: !1000, inlinedAt: !1091)
!1115 = !DILocation(line: 144, column: 43, scope: !1000, inlinedAt: !1091)
!1116 = !DILocation(line: 144, column: 25, scope: !1000, inlinedAt: !1091)
!1117 = !DILocation(line: 145, column: 28, scope: !1000, inlinedAt: !1091)
!1118 = !DILocation(line: 145, column: 43, scope: !1000, inlinedAt: !1091)
!1119 = !DILocation(line: 145, column: 25, scope: !1000, inlinedAt: !1091)
!1120 = !DILocation(line: 133, column: 69, scope: !986, inlinedAt: !1091)
!1121 = distinct !{!1121, !1100, !1122, !1026}
!1122 = !DILocation(line: 149, column: 9, scope: !981, inlinedAt: !1091)
!1123 = !DILocation(line: 0, scope: !857, inlinedAt: !859)
!1124 = !DILocation(line: 286, column: 5, scope: !857, inlinedAt: !859)
!1125 = !DILocation(line: 0, scope: !1126, inlinedAt: !859)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 292, column: 13)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 287, column: 5)
!1128 = distinct !DILexicalBlock(scope: !857, file: !3, line: 286, column: 5)
!1129 = !DILocation(line: 292, column: 126, scope: !1126, inlinedAt: !859)
!1130 = !DILocation(line: 292, column: 136, scope: !1126, inlinedAt: !859)
!1131 = !DILocation(line: 292, column: 141, scope: !1126, inlinedAt: !859)
!1132 = !DILocation(line: 292, column: 13, scope: !1127, inlinedAt: !859)
!1133 = !DILocation(line: 295, column: 27, scope: !1127, inlinedAt: !859)
!1134 = !DILocation(line: 295, column: 9, scope: !1127, inlinedAt: !859)
!1135 = !DILocation(line: 295, column: 61, scope: !1127, inlinedAt: !859)
!1136 = !DILocation(line: 295, column: 46, scope: !1127, inlinedAt: !859)
!1137 = !DILocation(line: 286, column: 42, scope: !1128, inlinedAt: !859)
!1138 = !DILocation(line: 286, column: 23, scope: !1128, inlinedAt: !859)
!1139 = !DILocation(line: 286, column: 25, scope: !1128, inlinedAt: !859)
!1140 = distinct !{!1140, !1124, !1141, !1026}
!1141 = !DILocation(line: 296, column: 5, scope: !857, inlinedAt: !859)
!1142 = !DILocation(line: 0, scope: !586, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 298, column: 12, scope: !806, inlinedAt: !859)
!1144 = !DILocation(line: 458, column: 37, scope: !586, inlinedAt: !1143)
!1145 = !DILocation(line: 458, column: 26, scope: !586, inlinedAt: !1143)
!1146 = !DILocation(line: 458, column: 18, scope: !586, inlinedAt: !1143)
!1147 = !DILocation(line: 459, column: 41, scope: !586, inlinedAt: !1143)
!1148 = !DILocation(line: 459, column: 30, scope: !586, inlinedAt: !1143)
!1149 = !DILocation(line: 459, column: 22, scope: !586, inlinedAt: !1143)
!1150 = !DILocation(line: 462, column: 14, scope: !609, inlinedAt: !1143)
!1151 = !DILocation(line: 462, column: 18, scope: !609, inlinedAt: !1143)
!1152 = !DILocation(line: 462, column: 9, scope: !586, inlinedAt: !1143)
!1153 = !DILocation(line: 467, column: 5, scope: !586, inlinedAt: !1143)
!1154 = !DILocation(line: 468, column: 5, scope: !586, inlinedAt: !1143)
!1155 = !DILocation(line: 468, column: 10, scope: !586, inlinedAt: !1143)
!1156 = !DILocation(line: 468, column: 19, scope: !586, inlinedAt: !1143)
!1157 = !DILocation(line: 0, scope: !617, inlinedAt: !1158)
!1158 = distinct !DILocation(line: 470, column: 21, scope: !586, inlinedAt: !1143)
!1159 = !DILocation(line: 0, scope: !359, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 349, column: 25, scope: !617, inlinedAt: !1158)
!1161 = !DILocation(line: 257, column: 13, scope: !370, inlinedAt: !1160)
!1162 = !DILocation(line: 257, column: 19, scope: !370, inlinedAt: !1160)
!1163 = !DILocation(line: 257, column: 17, scope: !370, inlinedAt: !1160)
!1164 = !DILocation(line: 257, column: 9, scope: !359, inlinedAt: !1160)
!1165 = !DILocation(line: 0, scope: !375, inlinedAt: !1166)
!1166 = distinct !DILocation(line: 350, column: 27, scope: !617, inlinedAt: !1158)
!1167 = !DILocation(line: 245, column: 13, scope: !385, inlinedAt: !1166)
!1168 = !DILocation(line: 245, column: 19, scope: !385, inlinedAt: !1166)
!1169 = !DILocation(line: 245, column: 17, scope: !385, inlinedAt: !1166)
!1170 = !DILocation(line: 245, column: 9, scope: !375, inlinedAt: !1166)
!1171 = !DILocation(line: 351, column: 5, scope: !617, inlinedAt: !1158)
!1172 = !DILocation(line: 351, column: 27, scope: !617, inlinedAt: !1158)
!1173 = !DILocation(line: 355, column: 38, scope: !657, inlinedAt: !1158)
!1174 = !DILocation(line: 355, column: 9, scope: !617, inlinedAt: !1158)
!1175 = !DILocation(line: 348, column: 26, scope: !617, inlinedAt: !1158)
!1176 = !DILocation(line: 358, column: 20, scope: !617, inlinedAt: !1158)
!1177 = !DILocation(line: 359, column: 5, scope: !617, inlinedAt: !1158)
!1178 = !DILocation(line: 361, column: 5, scope: !617, inlinedAt: !1158)
!1179 = !DILocation(line: 364, column: 14, scope: !664, inlinedAt: !1158)
!1180 = !DILocation(line: 364, column: 13, scope: !634, inlinedAt: !1158)
!1181 = !DILocation(line: 367, column: 20, scope: !634, inlinedAt: !1158)
!1182 = !DILocation(line: 367, column: 27, scope: !634, inlinedAt: !1158)
!1183 = !DILocation(line: 368, column: 31, scope: !634, inlinedAt: !1158)
!1184 = !DILocation(line: 368, column: 20, scope: !634, inlinedAt: !1158)
!1185 = !DILocation(line: 368, column: 24, scope: !634, inlinedAt: !1158)
!1186 = !DILocation(line: 369, column: 39, scope: !634, inlinedAt: !1158)
!1187 = !DILocation(line: 369, column: 20, scope: !634, inlinedAt: !1158)
!1188 = !DILocation(line: 369, column: 32, scope: !634, inlinedAt: !1158)
!1189 = !DILocation(line: 370, column: 20, scope: !634, inlinedAt: !1158)
!1190 = !DILocation(line: 370, column: 26, scope: !634, inlinedAt: !1158)
!1191 = !DILocation(line: 371, column: 20, scope: !634, inlinedAt: !1158)
!1192 = !DILocation(line: 371, column: 26, scope: !634, inlinedAt: !1158)
!1193 = !DILocation(line: 372, column: 30, scope: !634, inlinedAt: !1158)
!1194 = !DILocation(line: 372, column: 20, scope: !634, inlinedAt: !1158)
!1195 = !DILocation(line: 372, column: 28, scope: !634, inlinedAt: !1158)
!1196 = !DILocation(line: 373, column: 36, scope: !634, inlinedAt: !1158)
!1197 = !DILocation(line: 373, column: 20, scope: !634, inlinedAt: !1158)
!1198 = !DILocation(line: 373, column: 29, scope: !634, inlinedAt: !1158)
!1199 = !DILocation(line: 374, column: 36, scope: !634, inlinedAt: !1158)
!1200 = !DILocation(line: 374, column: 20, scope: !634, inlinedAt: !1158)
!1201 = !DILocation(line: 374, column: 29, scope: !634, inlinedAt: !1158)
!1202 = !DILocation(line: 375, column: 9, scope: !634, inlinedAt: !1158)
!1203 = !DILocation(line: 378, column: 14, scope: !699, inlinedAt: !1158)
!1204 = !DILocation(line: 378, column: 13, scope: !634, inlinedAt: !1158)
!1205 = !DILocation(line: 381, column: 18, scope: !702, inlinedAt: !1158)
!1206 = !DILocation(line: 381, column: 28, scope: !702, inlinedAt: !1158)
!1207 = !DILocation(line: 381, column: 13, scope: !634, inlinedAt: !1158)
!1208 = !DILocation(line: 384, column: 62, scope: !634, inlinedAt: !1158)
!1209 = !DILocation(line: 0, scope: !634, inlinedAt: !1158)
!1210 = !DILocation(line: 385, column: 62, scope: !634, inlinedAt: !1158)
!1211 = !DILocation(line: 387, column: 20, scope: !634, inlinedAt: !1158)
!1212 = !DILocation(line: 387, column: 27, scope: !634, inlinedAt: !1158)
!1213 = !DILocation(line: 388, column: 20, scope: !634, inlinedAt: !1158)
!1214 = !DILocation(line: 388, column: 24, scope: !634, inlinedAt: !1158)
!1215 = !DILocation(line: 389, column: 31, scope: !634, inlinedAt: !1158)
!1216 = !DILocation(line: 389, column: 46, scope: !634, inlinedAt: !1158)
!1217 = !DILocation(line: 389, column: 20, scope: !634, inlinedAt: !1158)
!1218 = !DILocation(line: 389, column: 29, scope: !634, inlinedAt: !1158)
!1219 = !DILocation(line: 390, column: 39, scope: !634, inlinedAt: !1158)
!1220 = !DILocation(line: 390, column: 20, scope: !634, inlinedAt: !1158)
!1221 = !DILocation(line: 390, column: 32, scope: !634, inlinedAt: !1158)
!1222 = !DILocation(line: 391, column: 20, scope: !634, inlinedAt: !1158)
!1223 = !DILocation(line: 391, column: 26, scope: !634, inlinedAt: !1158)
!1224 = !DILocation(line: 392, column: 20, scope: !634, inlinedAt: !1158)
!1225 = !DILocation(line: 392, column: 26, scope: !634, inlinedAt: !1158)
!1226 = !DILocation(line: 393, column: 30, scope: !634, inlinedAt: !1158)
!1227 = !DILocation(line: 393, column: 20, scope: !634, inlinedAt: !1158)
!1228 = !DILocation(line: 393, column: 28, scope: !634, inlinedAt: !1158)
!1229 = !DILocation(line: 394, column: 21, scope: !634, inlinedAt: !1158)
!1230 = !DILocation(line: 395, column: 21, scope: !634, inlinedAt: !1158)
!1231 = !DILocation(line: 396, column: 9, scope: !634, inlinedAt: !1158)
!1232 = !DILocation(line: 405, column: 31, scope: !617, inlinedAt: !1158)
!1233 = !DILocation(line: 405, column: 16, scope: !617, inlinedAt: !1158)
!1234 = !DILocation(line: 405, column: 24, scope: !617, inlinedAt: !1158)
!1235 = !DILocation(line: 407, column: 29, scope: !617, inlinedAt: !1158)
!1236 = !DILocation(line: 407, column: 14, scope: !617, inlinedAt: !1158)
!1237 = !DILocation(line: 409, column: 5, scope: !617, inlinedAt: !1158)
!1238 = !DILocation(line: 412, column: 13, scope: !638, inlinedAt: !1158)
!1239 = !DILocation(line: 0, scope: !741, inlinedAt: !1240)
!1240 = distinct !DILocation(line: 413, column: 13, scope: !748, inlinedAt: !1158)
!1241 = !DILocation(line: 156, column: 31, scope: !741, inlinedAt: !1240)
!1242 = !DILocation(line: 158, column: 11, scope: !741, inlinedAt: !1240)
!1243 = !DILocation(line: 159, column: 43, scope: !741, inlinedAt: !1240)
!1244 = !DILocation(line: 159, column: 34, scope: !741, inlinedAt: !1240)
!1245 = !DILocation(line: 159, column: 16, scope: !741, inlinedAt: !1240)
!1246 = !DILocation(line: 160, column: 19, scope: !741, inlinedAt: !1240)
!1247 = !DILocation(line: 160, column: 12, scope: !741, inlinedAt: !1240)
!1248 = !DILocation(line: 413, column: 13, scope: !748, inlinedAt: !1158)
!1249 = !DILocation(line: 415, column: 18, scope: !760, inlinedAt: !1158)
