; ModuleID = 'xdp_ping_count.c'
source_filename = "xdp_ping_count.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.icmphdr = type { i8, i8, i16, %union.anon }
%union.anon = type { i32 }

@counter_map = dso_local global %struct.bpf_map_def { i32 1, i32 4, i32 4, i32 65535, i32 0 }, section "maps", align 4, !dbg !0
@__const.counter1_func.msg = private unnamed_addr constant [25 x i8] c"recv ip %d src-addr %s\0D\0A\00", align 1
@__const.counter1_func.msg.2 = private unnamed_addr constant [39 x i8] c"recc icmp code %d type %d gateway %d\0D\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !21
@llvm.used = appending global [4 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (i32 (%struct.xdp_md*)* @counter1_func to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @counter_func to i8*), i8* bitcast (%struct.bpf_map_def* @counter_map to i8*)], section "llvm.metadata"

; Function Attrs: nounwind
define dso_local i32 @counter_func(%struct.xdp_md* nocapture readonly %0) #0 section "counter" !dbg !48 {
  %2 = alloca [25 x i8], align 1
  %3 = alloca [39 x i8], align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "counter_map", scope: !2, file: !3, line: 19, type: !36, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_ping_count.c", directory: "/root/workspace/ebpf-app/ebpf/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3150, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !{!15, !16, !17}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !18, line: 24, baseType: !19)
!18 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!19 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!20 = !{!0, !21, !27}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 142, type: !23, isLocal: false, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 4)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !29, line: 171, type: !30, isLocal: true, isDefinition: true)
!29 = !DIFile(filename: "../libbpf/src/bpf_helper_defs.h", directory: "/root/workspace/ebpf-app/ebpf/src")
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!16, !33, !35, null}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !18, line: 27, baseType: !7)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !37, line: 130, size: 160, elements: !38)
!37 = !DIFile(filename: "../libbpf/src/bpf_helpers.h", directory: "/root/workspace/ebpf-app/ebpf/src")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !37, line: 131, baseType: !7, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !36, file: !37, line: 132, baseType: !7, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !36, file: !37, line: 133, baseType: !7, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !36, file: !37, line: 134, baseType: !7, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !36, file: !37, line: 135, baseType: !7, size: 32, offset: 128)
!44 = !{i32 7, !"Dwarf Version", i32 4}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{i32 1, !"wchar_size", i32 4}
!47 = !{!"clang version 10.0.0-4ubuntu1 "}
!48 = distinct !DISubprogram(name: "counter_func", scope: !3, file: !3, line: 31, type: !49, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !60)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !52}
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3161, size: 160, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !6, line: 3162, baseType: !35, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !53, file: !6, line: 3163, baseType: !35, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !53, file: !6, line: 3164, baseType: !35, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !53, file: !6, line: 3166, baseType: !35, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !53, file: !6, line: 3167, baseType: !35, size: 32, offset: 128)
!60 = !{!61, !62, !63, !64, !69, !70, !84, !105, !111, !135}
!61 = !DILocalVariable(name: "ctx", arg: 1, scope: !48, file: !3, line: 31, type: !52)
!62 = !DILocalVariable(name: "data_end", scope: !48, file: !3, line: 33, type: !15)
!63 = !DILocalVariable(name: "data", scope: !48, file: !3, line: 34, type: !15)
!64 = !DILocalVariable(name: "nh", scope: !48, file: !3, line: 36, type: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !66, line: 33, size: 64, elements: !67)
!66 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/workspace/ebpf-app/ebpf/src")
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !65, file: !66, line: 34, baseType: !15, size: 64)
!69 = !DILocalVariable(name: "nh_type", scope: !48, file: !3, line: 37, type: !51)
!70 = !DILocalVariable(name: "eth", scope: !48, file: !3, line: 40, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !73, line: 163, size: 112, elements: !74)
!73 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!74 = !{!75, !80, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !72, file: !73, line: 164, baseType: !76, size: 48)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 48, elements: !78)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!79}
!79 = !DISubrange(count: 6)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !72, file: !73, line: 165, baseType: !76, size: 48, offset: 48)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !72, file: !73, line: 166, baseType: !82, size: 16, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !83, line: 25, baseType: !17)
!83 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!84 = !DILocalVariable(name: "iph", scope: !85, file: !3, line: 46, type: !87)
!85 = distinct !DILexicalBlock(scope: !86, file: !3, line: 45, column: 5)
!86 = distinct !DILexicalBlock(scope: !48, file: !3, line: 44, column: 9)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !89, line: 86, size: 160, elements: !90)
!89 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!90 = !{!91, !93, !94, !95, !96, !97, !98, !99, !100, !102, !104}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !88, file: !89, line: 88, baseType: !92, size: 4, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !18, line: 21, baseType: !77)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !88, file: !89, line: 89, baseType: !92, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !88, file: !89, line: 96, baseType: !92, size: 8, offset: 8)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !88, file: !89, line: 97, baseType: !82, size: 16, offset: 16)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !88, file: !89, line: 98, baseType: !82, size: 16, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !88, file: !89, line: 99, baseType: !82, size: 16, offset: 48)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !88, file: !89, line: 100, baseType: !92, size: 8, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !88, file: !89, line: 101, baseType: !92, size: 8, offset: 72)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !88, file: !89, line: 102, baseType: !101, size: 16, offset: 80)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !83, line: 31, baseType: !17)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !88, file: !89, line: 103, baseType: !103, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !83, line: 27, baseType: !35)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !88, file: !89, line: 104, baseType: !103, size: 32, offset: 128)
!105 = !DILocalVariable(name: "msg", scope: !106, file: !3, line: 49, type: !108)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 48, column: 9)
!107 = distinct !DILexicalBlock(scope: !85, file: !3, line: 47, column: 13)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 200, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 25)
!111 = !DILocalVariable(name: "icmph", scope: !85, file: !3, line: 53, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !114, line: 69, size: 64, elements: !115)
!114 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "")
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !114, line: 70, baseType: !92, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !113, file: !114, line: 71, baseType: !92, size: 8, offset: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !113, file: !114, line: 72, baseType: !101, size: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !113, file: !114, line: 84, baseType: !120, size: 32, offset: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !114, line: 73, size: 32, elements: !121)
!121 = !{!122, !127, !128, !133}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !120, file: !114, line: 77, baseType: !123, size: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !114, line: 74, size: 32, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !114, line: 75, baseType: !82, size: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !123, file: !114, line: 76, baseType: !82, size: 16, offset: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !120, file: !114, line: 78, baseType: !103, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !120, file: !114, line: 82, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !114, line: 79, size: 32, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !129, file: !114, line: 80, baseType: !82, size: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !129, file: !114, line: 81, baseType: !82, size: 16, offset: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !120, file: !114, line: 83, baseType: !134, size: 32)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !25)
!135 = !DILocalVariable(name: "msg", scope: !136, file: !3, line: 56, type: !138)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 55, column: 9)
!137 = distinct !DILexicalBlock(scope: !85, file: !3, line: 54, column: 13)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 312, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 39)
!141 = !DILocation(line: 0, scope: !48)
!142 = !DILocation(line: 33, column: 41, scope: !48)
!143 = !{!144, !145, i64 4}
!144 = !{!"xdp_md", !145, i64 0, !145, i64 4, !145, i64 8, !145, i64 12, !145, i64 16}
!145 = !{!"int", !146, i64 0}
!146 = !{!"omnipotent char", !147, i64 0}
!147 = !{!"Simple C/C++ TBAA"}
!148 = !DILocation(line: 33, column: 30, scope: !48)
!149 = !DILocation(line: 33, column: 22, scope: !48)
!150 = !DILocation(line: 34, column: 37, scope: !48)
!151 = !{!144, !145, i64 0}
!152 = !DILocation(line: 34, column: 26, scope: !48)
!153 = !DILocation(line: 34, column: 18, scope: !48)
!154 = !DILocalVariable(name: "nh", arg: 1, scope: !155, file: !66, line: 124, type: !158)
!155 = distinct !DISubprogram(name: "parse_ethhdr", scope: !66, file: !66, line: 124, type: !156, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !160)
!156 = !DISubroutineType(types: !157)
!157 = !{!51, !158, !15, !159}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!160 = !{!154, !161, !162}
!161 = !DILocalVariable(name: "data_end", arg: 2, scope: !155, file: !66, line: 125, type: !15)
!162 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !155, file: !66, line: 126, type: !159)
!163 = !DILocation(line: 0, scope: !155, inlinedAt: !164)
!164 = distinct !DILocation(line: 42, column: 15, scope: !48)
!165 = !DILocalVariable(name: "nh", arg: 1, scope: !166, file: !66, line: 79, type: !158)
!166 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !66, file: !66, line: 79, type: !167, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !176)
!167 = !DISubroutineType(types: !168)
!168 = !{!51, !158, !15, !159, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !66, line: 64, size: 32, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !170, file: !66, line: 65, baseType: !173, size: 32)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !{!165, !177, !178, !179, !180, !181, !182, !188, !189}
!177 = !DILocalVariable(name: "data_end", arg: 2, scope: !166, file: !66, line: 80, type: !15)
!178 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !166, file: !66, line: 81, type: !159)
!179 = !DILocalVariable(name: "vlans", arg: 4, scope: !166, file: !66, line: 82, type: !169)
!180 = !DILocalVariable(name: "eth", scope: !166, file: !66, line: 84, type: !71)
!181 = !DILocalVariable(name: "hdrsize", scope: !166, file: !66, line: 85, type: !51)
!182 = !DILocalVariable(name: "vlh", scope: !166, file: !66, line: 86, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !66, line: 42, size: 32, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !184, file: !66, line: 43, baseType: !82, size: 16)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !184, file: !66, line: 44, baseType: !82, size: 16, offset: 16)
!188 = !DILocalVariable(name: "h_proto", scope: !166, file: !66, line: 87, type: !17)
!189 = !DILocalVariable(name: "i", scope: !166, file: !66, line: 88, type: !51)
!190 = !DILocation(line: 0, scope: !166, inlinedAt: !191)
!191 = distinct !DILocation(line: 129, column: 9, scope: !155, inlinedAt: !164)
!192 = !DILocation(line: 93, column: 14, scope: !193, inlinedAt: !191)
!193 = distinct !DILexicalBlock(scope: !166, file: !66, line: 93, column: 6)
!194 = !DILocation(line: 93, column: 24, scope: !193, inlinedAt: !191)
!195 = !DILocation(line: 93, column: 6, scope: !166, inlinedAt: !191)
!196 = !DILocation(line: 99, column: 17, scope: !166, inlinedAt: !191)
!197 = !{!198, !198, i64 0}
!198 = !{!"short", !146, i64 0}
!199 = !DILocation(line: 0, scope: !200, inlinedAt: !191)
!200 = distinct !DILexicalBlock(scope: !201, file: !66, line: 109, column: 7)
!201 = distinct !DILexicalBlock(scope: !202, file: !66, line: 105, column: 39)
!202 = distinct !DILexicalBlock(scope: !203, file: !66, line: 105, column: 2)
!203 = distinct !DILexicalBlock(scope: !166, file: !66, line: 105, column: 2)
!204 = !DILocation(line: 105, column: 2, scope: !203, inlinedAt: !191)
!205 = !DILocation(line: 106, column: 7, scope: !201, inlinedAt: !191)
!206 = !DILocation(line: 109, column: 11, scope: !200, inlinedAt: !191)
!207 = !DILocation(line: 109, column: 15, scope: !200, inlinedAt: !191)
!208 = !DILocation(line: 109, column: 7, scope: !201, inlinedAt: !191)
!209 = !DILocation(line: 112, column: 18, scope: !201, inlinedAt: !191)
!210 = !DILocation(line: 44, column: 31, scope: !86)
!211 = !DILocation(line: 44, column: 9, scope: !48)
!212 = !DILocalVariable(name: "nh", arg: 1, scope: !213, file: !66, line: 151, type: !158)
!213 = distinct !DISubprogram(name: "parse_iphdr", scope: !66, file: !66, line: 151, type: !214, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !217)
!214 = !DISubroutineType(types: !215)
!215 = !{!51, !158, !15, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!217 = !{!212, !218, !219, !220, !221}
!218 = !DILocalVariable(name: "data_end", arg: 2, scope: !213, file: !66, line: 152, type: !15)
!219 = !DILocalVariable(name: "iphdr", arg: 3, scope: !213, file: !66, line: 153, type: !216)
!220 = !DILocalVariable(name: "iph", scope: !213, file: !66, line: 155, type: !87)
!221 = !DILocalVariable(name: "hdrsize", scope: !213, file: !66, line: 156, type: !51)
!222 = !DILocation(line: 0, scope: !213, inlinedAt: !223)
!223 = distinct !DILocation(line: 47, column: 40, scope: !107)
!224 = !DILocation(line: 158, column: 10, scope: !225, inlinedAt: !223)
!225 = distinct !DILexicalBlock(scope: !213, file: !66, line: 158, column: 6)
!226 = !DILocation(line: 158, column: 14, scope: !225, inlinedAt: !223)
!227 = !DILocation(line: 158, column: 6, scope: !213, inlinedAt: !223)
!228 = !DILocation(line: 161, column: 17, scope: !213, inlinedAt: !223)
!229 = !DILocation(line: 161, column: 21, scope: !213, inlinedAt: !223)
!230 = !DILocation(line: 163, column: 13, scope: !231, inlinedAt: !223)
!231 = distinct !DILexicalBlock(scope: !213, file: !66, line: 163, column: 5)
!232 = !DILocation(line: 163, column: 5, scope: !213, inlinedAt: !223)
!233 = !DILocation(line: 163, column: 5, scope: !231, inlinedAt: !223)
!234 = !DILocation(line: 167, column: 14, scope: !235, inlinedAt: !223)
!235 = distinct !DILexicalBlock(scope: !213, file: !66, line: 167, column: 6)
!236 = !DILocation(line: 167, column: 24, scope: !235, inlinedAt: !223)
!237 = !DILocation(line: 167, column: 6, scope: !213, inlinedAt: !223)
!238 = !DILocation(line: 173, column: 14, scope: !213, inlinedAt: !223)
!239 = !{!240, !146, i64 9}
